[
    {
        "companyName": "Nagarro",
        "iconUrl": "https://jobdataapi.com/media/company/logo/22/10/7fKE8FL9_400x400.png",
        "jobTitle": "Associate Distinguished Engineer, Enterprise Architect (Cloud Architect)",
        "location": "Remote, India",
        "jobType": "Full Time",
        "hasRemote": false,
        "easyApply": false,
        "published": "2024-07-03T12:36:18Z",
        "description": "<h3>Company Description</h3><p><strong>👋🏼We're Nagarro</strong></p><p>We are a Digital Product Engineering company that is scaling in a big way! We build products, services, and experiences that inspire, excite, and delight. We work at scale — across all devices and digital mediums, and our people exist everywhere in the world (18000+ experts across 36 countries, to be exact). Our work culture is dynamic and non-hierarchical. We're looking for great new colleagues. That's where you come in.</p><h3>Job Description</h3><p><strong>LOCATIONS: </strong>Gurgaon/ Noida/ Pune/ Jaipur/ Bangalore/ Hyderabad</p><p><strong>REQUIREMENTS:</strong></p><ul><li>Experience: 14+yrs</li><li>Strong Cloud Architecture experience with MSA and TOGAF certified (preferred)</li><li>15+yrs experience and a strong background to work on highly scalable and complex Enterprise SaaS applications with a hands-on knowledge and experience with any of the major public cloud providers.</li><li>Should have a good track record of architecting, designing and delivering complex cloud-based solutions along with capabilities to design architecture for complex multi-tenant, distributed cloud implementations, cloud migrations and hybrid cloud implementations with an agile mindset and strong communication skills to collaborate on sales/presales pitches</li><li>Hands on experience in designing and developing technology solutions using a variety of platforms, languages, and tools, with at least 5+ years of software architecture experience.</li><li>Ability to think breakthroughs by leveraging new age technologies and a deep understanding of the client’s business and the industry they operate in.</li><li>Ability to lead by example by picking up coding of complex functionalities when required.</li><li>Strong understanding of technology and the ability to deep dive into a technology problem.</li><li>Ability to influence key client stakeholders on their technology and operations strategy.</li><li>Vast experience in owning delivery of complex technology solutions for global clients.</li><li>Ability to multitask and own multiple technology tracks simultaneously in a globally distributed delivery setup.</li><li>Experience in creating cutting edge technology solution by collaborating with other world class technologists</li><li>Balanced approach that aligns technology-based solutions with customer needs.</li><li>Visible thought leadership through technology blogs, whitepapers, presentations etc.</li><li>Fluent verbal and written language skills and ability to convey a message in a simple and structured manner, customized to the audience and to the mode of communication.</li></ul><p><strong>RESPONSIBILITIES:</strong></p><ul><li>Preferred experience of working in all mobile, web and backend solutions.</li><li>Knowledge of Enterprise Architecture Frameworks like TOGAF, Zachman.</li><li>Excellent Solution designing skills identifying the proper technology stack.</li><li>Excellent understanding of Agile practices using Lean, Scrum and Kanban.</li><li>Excellent knowledge of SOA and Microservices architecture pattern encapsulating transaction scenarios.</li><li>Good Problem-Solving Skills and ability to solve problems using innovative approach.</li><li>Ability to create solution design encompassing functional, Logical, Component, Data, Integration, Security and Deployment aspects.</li><li>Have experience in working on all aspects of product lifecycle from Design, development, deployment, DevOps, and continuous integration.</li><li>Defining business requirements as per discussion with various stakeholders.</li><li>Proficiency on design and architecture on Multiple domains and technology stacks</li><li>Ability to work along with teams for technical insights and with customer on technical consulting and solutions.</li><li>Excellent communication skills Proficient and hands on in at least on one technology and able to adapt in providing solutions in different tech stacks.</li><li>Client-centric and a team player Significant exposure in responding to RFPs.</li></ul><h3>Qualifications</h3><p>Bachelor's or Master's degree in computer science, Information Technology, or a related field.</p><h3>Additional Information</h3><p><a href=\"https://www.nagarro.com/hubfs/NagarroWebsiteRedesign-Aug2020/Assets/Docs/Applicant%20Privacy%20Notice-EN.pdf\">Click here to access the application privacy notice</a></p>",
        "applicationUrl": "https://jobs.smartrecruiters.com/Nagarro1/743999998159575-associate-distinguished-engineer-enterprise-architect-cloud-architect-",
        "language": "en",
        "clearanceRequired": true,
        "salaryCurrency": "10 LPA",
        "jobVacancies": 6,
        "companyWebsiteUrl": "https://www.nagarro.com",
        "companyLinkedinUrl": "https://www.linkedin.com/company/nagarro",
        "companyRating": 3.2,
        "companyLocation": "Remote, India",
        "companySize": 191,
        "industry": "Transportation",
        "companyDescription": "The transportation industry covers the movement of people and goods through various modes such as road, rail, air, and sea, ensuring the efficient flow of goods and services."
    },
    {
        "companyName": "Verisk",
        "iconUrl": "https://jobdataapi.com/media/company/logo/22/10/yjJUAsok_400x400_CUv0Qlr.jpg",
        "jobTitle": "Sr. DevOps Engineer I (AWS, Python, Automation)",
        "location": "Hyderabad, India",
        "jobType": "Full Time",
        "hasRemote": false,
        "easyApply": true,
        "published": "2024-07-03T12:16:54Z",
        "description": "<h3>Company Description</h3><p>We help the world see new possibilities and inspire change for better tomorrows. Our analytic solutions bridge content, data, and analytics to help business, people, and society become stronger, more resilient, and sustainable.</p><h3>Job Description</h3><p>As a DevOps Engineer, you will be part of an agile software engineering team, driving development and maintenance of AD3I software applications. The range and scope of duties for this position include providing support to the development teams with their builds and deployments and interacting with the customers for installing applications and troubleshooting. The role demands excellent written and speaking skills along with the server-side coding expertise using the scripting languages.</p><p><strong><u>Responsibilities</u></strong></p><ul><li>Create efficient automated deployment workflows supporting development through testing and production deployment using scripting languages such as ANT, Python, Groovy etc.</li><li>With the support of the QA team run performance testing on the applications developed</li><li>Troubleshooting the application errors and adapt working with new technologies as required.</li><li>Work and communicate effectively in a team environment and with the engineering department as a whole</li></ul><h3>Qualifications</h3><ol><li>3+ years of DevOps or combined software development and system administration experience</li><li>Working experience with Amazon Web Services or other cloud providers.</li><li>Experience with PowerShell, Groovy, Python, ANT, and C# on .Net 4.5</li><li>Experience with Microsoft SQL server, Oracle DBs.</li><li>Experience with Infrastructure as Code or Config as Code (PowerShell DSC, Chef, Puppet, Jenkins)</li><li>Must have experience in using Chef/Jenkins tools</li><li>Experience with/exposure to Insurance Domain (preferred but not required)</li><li>Familiarity with Windows, Linux Operating Systems</li><li>Experience with software, interface, or testing approaches and design patterns</li><li>Effective communication and documentation skills</li></ol><h3>Additional Information</h3><p>For over 50 years, Verisk has been the leading data analytics and technology partner to the global insurance industry by delivering value to our clients through expertise and scale. We empower communities and businesses to make better decisions on risk, faster.</p><p>At Verisk, you'll have the chance to use your voice and build a rewarding career that's as unique as you are, with work flexibility and the support, coaching, and training you need to succeed. </p><p>For the eighth consecutive year, Verisk is proudly recognized as a Great Place to Work® for outstanding workplace culture in the US, fourth consecutive year in the UK, Spain, and India, and second consecutive year in Poland.  We value learning, caring and results and make inclusivity and diversity a top priority.  In addition to our Great Place to Work® Certification, we’ve been recognized by The Wall Street Journal as one of the Best-Managed Companies and by Forbes as a World’s Best Employer and Best Employer for Women, testaments to the value we place on workplace culture.</p><p>We’re 7,000 people strong.  We relentlessly and ethically pursue innovation. And we are looking for people like you to help us translate big data into big ideas. Join us and create an exceptional experience for yourself and a better tomorrow for future generations.</p><p><strong>Verisk Businesses</strong></p><p><a href=\"https://www.verisk.com/insurance/capabilities/underwriting/\">Underwriting Solutions</a> — provides underwriting and rating solutions for auto and property, general liability, and excess and surplus to assess and price risk with speed and precision</p><p><a href=\"https://www.verisk.com/insurance/capabilities/claims/\">Claims Solutions</a> — supports end-to-end claims handling with analytic and automation tools that streamline workflow, improve claims management, and support better customer experiences</p><p><a href=\"https://www.verisk.com/property-estimating-solutions/\">Property Estimating Solutions</a> — offers property estimation software and tools for professionals in estimating all phases of building and repair to make day-to-day workflows the most efficient</p><p><a href=\"https://www.air-worldwide.com/\">Extreme Event Solutions</a> — provides risk modeling solutions to help individuals, businesses, and society become more resilient to extreme events.</p><p><a href=\"https://www.verisksequel.com/\">Specialty Business Solutions</a> — provides an integrated suite of software for full end-to-end management of insurance and reinsurance business, helping companies manage their businesses through efficiency, flexibility, and data governance</p><p><a href=\"https://www.verisk.com/verisk-marketing-solutions/\">Marketing Solutions</a> — delivers data and insights to improve the reach, timing, relevance, and compliance of every consumer engagement</p><p><a href=\"https://www.verisk.com/insurance/life-insurance/\">Life Insurance Solutions</a> – offers end-to-end, data insight-driven core capabilities for carriers, distribution, and direct customers across the entire policy lifecycle of life and annuities for both individual and group.</p><p><a href=\"https://www.maplecroft.com/\">Verisk Maplecroft</a> — provides intelligence on sustainability, resilience, and ESG, helping people, business, and societies become stronger</p><p>Verisk Analytics is an equal opportunity employer.</p><p>All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.</p><p><a href=\"http://www.verisk.com/careers.html\">http://www.verisk.com/careers.html</a></p><p>Unsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.</p>",
        "applicationUrl": "https://jobs.smartrecruiters.com/Verisk/743999998153441-sr-devops-engineer-i-aws-python-automation-",
        "language": "en",
        "clearanceRequired": true,
        "salaryCurrency": "10 LPA",
        "jobVacancies": 10,
        "companyWebsiteUrl": "https://www.verisk.com",
        "companyLinkedinUrl": "https://www.linkedin.com/company/verisk-analytics",
        "companyRating": 2.8,
        "companyLocation": "Hyderabad, India",
        "companySize": 59,
        "industry": "Finance",
        "companyDescription": "The finance industry includes services related to banking, investments, insurance, and financial planning, managing the flow of money in the economy."
    },
    {
        "companyName": "Disney+ Hotstar",
        "iconUrl": "https://jobdataapi.com/media/company/logo/23/07/DisneyPlusHS.jpg",
        "jobTitle": "Staff Software Engineer - Backend + ML , Disney+ Hotstar",
        "location": "Bangalore",
        "jobType": "Full Time",
        "hasRemote": false,
        "easyApply": true,
        "published": "2024-07-03T12:10:02Z",
        "description": "<b>JOB SUMMARY: </b><span>As a Staff Engineer, you will play a pivotal role in building an end-to-end ML lifecycle with scale. Our recommendation engine creates personalized home page experiences for millions globally, adapting to user interests in real time. Leveraging ML algorithms and A/B testing, we continuously refine our recommendations. You'll thrive here if you're passionate about tackling complex technical challenges using big data, ML models, and building scalable services.</span><br/><b>ABOUT THE TEAM:</b><span> At Disney+ Hotstar, we're on a mission to deliver delightful experiences to our 500+ million customers across the globe. Our technology spans 25+ countries, with more on the horizon. The Customer Experience (CEX) team manages the entire customer journey, from signup to personalized content viewing on a wider range of consumer devices. Our fast and intuitive experiences cater to different user segments, including mobile, tablet, and living room viewers. Backed by distributed services, we innovate through experimentation and data-driven decisions.</span><br/><span>The Discovery Team focuses on revolutionizing content discovery. The aim is to provide users with an intuitive and personalized experience, enabling seamless exploration and enrichment of their interests. Collaborating with developers, data scientists, designers, and curators, we enhance algorithms and recommendation systems. By analyzing user preferences and behaviors, we deliver immersive content discovery. </span>\n<h3>KEY RESPONSIBILITIES: </h3>\n<ul>\n<li>Serves as the functional lead, possesses deep knowledge of core systems, and takes full responsibility for the team's code, design, and project delivery, ensuring high quality and on-time completion</li><li>Responsible for end-to-end <b>Machine Learning Lifecycle</b> and working with a diverse range of frameworks &amp; technologies from Big data frameworks like Spark, Flink, Kafka, etc to <b>ML frameworks like TensorFlow</b> serving </li><li>Design and implement low-latency caching and storage solutions</li><li>Build stream processing pipelines to compute near real-time features that will help us serve real-time recommendations for our users</li><li>You will continuously evaluate relevant technologies, influence, and drive architecture and design discussions</li><li>Tackles complex technical challenges independently for complex systems, demonstrating technical depth and proficiency</li><li>Collaborate with Product Managers and cross-functional teams to understand requirements and deploy high-quality software solutions that meet business objectives</li></ul>\n<h3>SKILLS &amp; ATTRIBUTES FOR SUCCESS: </h3>\n<ul>\n<li>Strong coding skills in Python, Java, Golang, or Scala</li><li>Experience with Big Data frameworks like Spark and Kubernetes for data and ML workloads</li><li>Proficient in implementing API performance monitoring solutions using tools such as Grafana, Prometheus, and Cloudwatch</li><li>Skilled in developing end-to-end machine learning pipelines ensuring consistency between development and production environments</li><li><b>Ability to design scalable ML architectures</b> tailored to site traffic and feature complexity for predictive algorithms</li><li>Familiar with model and data versioning, resource allocation and scaling, and logging to build optimal systems</li><li>Experienced in creating systems that monitor and react to faults in resources, data streams, and model responses</li><li><b>Expertise with MLOps tools</b> for scalable, production-level deployment, including feature stores, model hosting and versioning, data versioning, prediction and drift monitoring, and automated remediation</li><li>Strong problem-solving skills and the ability to work effectively in a fast-paced environment</li><li>Commitment to continuous learning and professional development</li></ul><b>ABOUT US: </b><span>Disney Star is a leading media &amp; entertainment company in India that reaches over 700 million viewers a month in nine different languages. Our entertainment portfolio which cuts across general entertainment, movies, sports, infotainment, kids, and lifestyle content generates over 20,000 hours of original content every year.  Disney+ Hotstar, India’s leading streaming platform, enables us to reach and entertain audiences anywhere, anytime. Disney+ Hotstar has changed the way Indians consume their entertainment - from their favorite TV shows and movies to sporting extravaganzas.  </span><span>Join us, and let's continue to inspire a billion imaginations.</span><br/><b>WHY JOIN US: </b><span>Because our employees and cast members are at the heart of everything we do, Disney offers a competitive total rewards package that includes pay, health and savings benefits, time-off programs, special educational opportunities, and more. Together, these rewards make up a comprehensive package that helps our employees grow personally and professionally and take advantage of the special extras that only Disney STAR can offer to make their journey memorable.</span>",
        "applicationUrl": "https://jobs.lever.co/hotstar/17d5add2-9ae3-4248-bb8c-ced13d36e8bf",
        "language": "en",
        "clearanceRequired": false,
        "salaryCurrency": "10 LPA",
        "jobVacancies": 6,
        "companyWebsiteUrl": "https://www.hotstar.com/",
        "companyLinkedinUrl": "https://www.linkedin.com/company/disney-hotstar/",
        "companyRating": 2.3,
        "companyLocation": "Bangalore",
        "companySize": 107,
        "industry": "Logistics",
        "companyDescription": "The logistics industry manages the flow of goods from point of origin to point of consumption, including warehousing, transportation, and inventory management."
    },
    {
        "companyName": "ServiceNow",
        "iconUrl": "https://jobdataapi.com/media/company/logo/22/10/qSd2WB84_400x400.jpg",
        "jobTitle": "Software Engineer - Full Stack",
        "location": "Hyderabad, India",
        "jobType": "Full Time",
        "hasRemote": true,
        "easyApply": false,
        "published": "2024-07-03T12:09:57Z",
        "description": "<h3>Company Description</h3><p><span>At ServiceNow, our technology makes the world work for everyone, and our people make it possible. We move fast because the world can’t wait, and we innovate in ways no one else can for our customers and communities. By joining ServiceNow, you are part of an ambitious team of change makers who have a restless curiosity and a drive for ingenuity. We know that your best work happens when you live your best life and share your unique talents, so we do everything we can to make that possible. We dream big together, supporting each other to make our individual and collective dreams come true. The future is ours, and it starts with you. </span></p> <p><span>With more than 7,700+ customers, we serve approximately 85% of the Fortune 500®, and we're proud to be one of FORTUNE 100 Best Companies to Work For® and World's Most Admired Companies™.</span></p> <p><span>Learn more on <a href=\"https://blogs.servicenow.com/category/life-at-now.html\">Life at Now blog</a> and <a href=\"https://www.youtube.com/playlist?list=PLtPPHGXv_JpmhypERyQKm5zO2Wd65QinB\">hear from our employees</a> about their experiences working at ServiceNow.</span></p> <p><span>Unsure if you meet all the qualifications of a job description but are deeply excited about the role? We still encourage you to apply! At ServiceNow, we are committed to creating an inclusive environment where all voices are heard, valued, and respected. We welcome all candidates, including individuals from non-traditional, varied backgrounds, that might not come from a typical path connected to this role. We believe skills and experience are transferrable, and the desire to dream big makes for great candidates.</span></p><h3>Job Description</h3><p><strong>What you get to do in this role:</strong><strong>  </strong> </p> <ul> <li>Build high-quality, clean, scalable and reusable code by enforcing best practices around software engineering architecture and processes (Code Reviews, Unit testing, etc.)</li> <li>Work with the product owners to understand detailed requirements and own your code from design, implementation, test automation and delivery of high-quality product to our users.</li> <li>Design software that is simple to use to allow customers to extend and customize the functionality to meet their specific needs</li> <li>Help design and implement new products and features while also enhancing the existing product suite<br/></li> </ul><h3>Qualifications</h3><p><strong>To be successful in this role you have:</strong></p><ul><li><strong>2+ years of experience with Java or a similar OO language</strong></li><li>Passion for <strong>JavaScript</strong> and the Web as  a platform, reusability, and componentization</li><li>Experience with data structures, algorithms, object-oriented design, design patterns, and performance/scale considerations</li><li>Experience with any of the modern UI frameworks like Angular, React or Vue</li><li>Analytical and design skills</li><li>Knowledge with Python is an added advantage</li><li>Working knowledge and ability to use tools to assist with daily tasks (IDE, debugger, build tools, source control, ServiceNow instances, profilers, system administration/Unix tools)</li></ul><p> </p><h3>Additional Information</h3><p><span>ServiceNow is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, creed, religion, sex, sexual orientation, national origin or nationality, ancestry, age, disability, gender identity or expression, marital status, veteran status or any other category protected by law.</span></p> <p><span>At ServiceNow, we lead with flexibility and trust in our distributed world of work. <a href=\"https://www.servicenow.com/content/dam/servicenow-assets/public/en-us/doc-type/other-document/careers/new-world-of-work-personas.pdf\">Click here</a> to learn about our work personas: flexible, remote and required-in-office.</span></p> <p><span>If you require a reasonable accommodation to complete any part of the application process, or are limited in the ability or unable to access or use this online application process and need an alternative method for applying, you may contact us at <a href=\"mailto:talent.acquisition@servicenow.com\">talent.acquisition@servicenow.com</a> for assistance.</span></p> <p><span>For positions requiring access to technical data subject to export control regulations, including Export Administration Regulations (EAR), ServiceNow may have to obtain export licensing approval from the U.S. Government for certain individuals. All employment is contingent upon ServiceNow obtaining any export license or other approval that may be required by the U.S. Government.</span></p> <p><span>Please Note: Fraudulent job postings/job scams are increasingly common. <a href=\"https://www.servicenow.com/fraudulent-job-scams.html\">Click here</a> to learn what to watch out for and how to protect yourself. All genuine ServiceNow job postings can be found through the <a href=\"https://www.servicenow.com/careers.html\">ServiceNow Careers site</a>.</span></p> <p> </p> <p><span>From Fortune. © 2022 Fortune Media IP Limited All rights reserved. Used under license.</span></p> <p><span>Fortune and Fortune Media IP Limited are not affiliated with, and do not endorse products or services of, ServiceNow.</span></p>",
        "applicationUrl": "https://jobs.smartrecruiters.com/ServiceNow/743999998152412-software-engineer-full-stack",
        "language": "en",
        "clearanceRequired": false,
        "salaryCurrency": "10 LPA",
        "jobVacancies": 5,
        "companyWebsiteUrl": "https://www.servicenow.com",
        "companyLinkedinUrl": "https://www.linkedin.com/company/servicenow",
        "companyRating": 4.2,
        "companyLocation": "Hyderabad, India",
        "companySize": 63,
        "industry": "Education",
        "companyDescription": "The education industry encompasses institutions and services dedicated to teaching and learning, including schools, colleges, universities, and educational technology."
    },
    {
        "companyName": "NielsenIQ",
        "iconUrl": "https://jobdataapi.com/media/company/logo/22/10/NielsenIQ.jpg",
        "jobTitle": "Engineer",
        "location": "Pune, India",
        "jobType": "Full Time",
        "hasRemote": true,
        "easyApply": false,
        "published": "2024-07-03T12:07:46Z",
        "description": "<h3>Job Description</h3><p>Our NielsenIQ Technology teams are working on revamping multiple platform, a unified, global, open data ecosystem powered by Microsoft Azure. Our clients around the world rely on NielsenIQ’s data and insights to innovate and grow. </p><p>As a Backend Software Engineer, you’ll be part of a team of smart, highly skilled technologists who are passionate about learning and prototyping cutting-edge technologies. Right now our CDAR platform is concentrating on application convergence with latest backend services with Spring boot technologies and leverage Jenkins to support things like CI/CD and integrations. Java 8 is primarily used to extend platform features along with continuing to adopt the best in class cloud-native, cloud-agnostic technologies. Our team is co-located and agile, with central technology hubs in Chicago, Madrid, Toronto, Chennai and Pune </p><p> </p><p><strong>Responsibilities</strong> </p><ul><li>Understanding user needs and how they fit into the overall, global solution design </li><li>Configuring &amp; Implementing Application and Integration Service to support Business needs </li><li>Prototyping new features and integrations aligned to business strategy by introducing innovation through technology  </li><li>Following source &amp; test-driven development best practices </li><li>Troubleshooting and identifying root cause analysis while resolving the issues </li></ul><h3>Qualifications</h3><ul><li>Minimum of <strong>4-7</strong> years of experience as a Backend engineer who works on Java frameworks like Spring boot, Spring Integration, Hibernate, Java POJO.</li><li>Development experience in unit and integration test cases like JUnit</li><li>Intermediate level of Database (SQL) skills to develop SQL queries, function and stored procedures. </li><li>Good Understanding on CI/CD Pipeline i.e. Jenkin </li><li>Strong knowledge of version control tools, preferably Bit bucket </li><li>Basic Knowledge on Linux/Unix environment (basic commands, shell scripting, etc.) </li><li>Demonstrated ability to thrive in an enterprise Agile/SCRUM  environment </li><li>Demonstrated ability to work as part of a Global Team </li><li>Strong troubleshooting and problem-solving skills </li><li>Excellent English communication skills, with the ability to effectively interface across cross-functional technology teams and the business  </li><li>Minimum B.S. degree in Computer Science, Computer Engineering or related field </li><li>Experience using  Collaboration Technologies: Azure DevOps, TFS, Jira, Confluence </li><li>Experience using Object-oriented languages Java </li><li>Experience using Atlassian tool suite, including JIRA, Confluence, BitBucket </li><li>Experience working with testing tools and Automation test needs </li><li>Motivated, high-potential performer, with demonstrated ability to influence and lead. </li><li>Strong communicator with excellent interpersonal skills. </li><li>Able to solve complex problems and successfully manage ambiguity and unexpected change. </li><li>Teachable and embracing of best practices and feedback as a means of continuous improvement. </li><li>Consistently high achiever marked by perseverance, humility and a positive outlook in the face of challenges. </li></ul><h3>Additional Information</h3><p><strong>Our Benefits</strong></p><ul><li>Flexible working environment</li><li>Volunteer time off</li><li>LinkedIn Learning</li><li>Employee-Assistance-Program (EAP)</li></ul>\n<p><strong>About NIQ</strong></p><p>NIQ is the world’s leading consumer intelligence company, delivering the most complete understanding of consumer buying behavior and revealing new pathways to growth. In 2023, NIQ combined with GfK, bringing together the two industry leaders with unparalleled global reach. With a holistic retail read and the most comprehensive consumer insights—delivered with advanced analytics through state-of-the-art platforms—NIQ delivers the Full View™. NIQ is an Advent International portfolio company with operations in 100+ markets, covering more than 90% of the world’s population.</p><p>For more information, visit NIQ.com</p><p>Want to keep up with our latest updates?</p><p>Follow us on: <a href=\"https://www.linkedin.com/company/nielseniq/mycompany/\">LinkedIn</a> | <a href=\"https://www.instagram.com/nielseniq/\">Instagram</a> | <a href=\"https://twitter.com/nielseniq\">Twitter</a> | <a href=\"https://www.facebook.com/NielsenIQ.global/\">Facebook</a></p>\n<p><strong>Our commitment to Diversity, Equity, and Inclusion</strong></p><p>NIQ is committed to reflecting the diversity of the clients, communities, and markets we measure within our own workforce. We exist to count everyone and are on a mission to systematically embed inclusion and diversity into all aspects of our workforce, measurement, and products. We enthusiastically invite candidates who share that mission to join us. We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, protected veteran status or any other protected class. Our global non-discrimination policy covers these protected classes in every market in which we do business worldwide. Learn more about how we are driving diversity and inclusion in everything we do by visiting the NIQ News Center: <a href=\"https://nam02.safelinks.protection.outlook.com/?url=https%3A%2F%2Fnielseniq.com%2Fglobal%2Fen%2Fnews-center%2Fdiversity-inclusion&amp;data=05%7C02%7CJenny.Rebecca%40nielseniq.com%7C6e534cbe3eb041842d5f08dc6dca121e%7C6ac7a1f45fb14153bb4f12d2020a1f7d%7C0%7C0%7C638505961881417602%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C0%7C%7C%7C&amp;sdata=B%2Fp40oNUpJOw1CNoc87EFXk%2BvxeO1jxYOSRCEKM%2Fz5Q%3D&amp;reserved=0\">https://nielseniq.com/global/en/news-center/diversity-inclusion</a></p>",
        "applicationUrl": "https://jobs.smartrecruiters.com/NielsenIQ/743999998153715-engineer",
        "language": "en",
        "clearanceRequired": false,
        "salaryCurrency": "10 LPA",
        "jobVacancies": 3,
        "companyWebsiteUrl": "https://nielseniq.com",
        "companyLinkedinUrl": "https://www.linkedin.com/company/nielseniq/",
        "companyRating": 3.8,
        "companyLocation": "Pune, India",
        "companySize": 31,
        "industry": "Mining",
        "companyDescription": "The mining industry extracts valuable minerals and other geological materials from the earth, essential for the production of goods and energy resources."
    },
    {
        "companyName": "KnowBe4, Inc.",
        "iconUrl": "https://jobdataapi.com/media/company/logo/22/03/KnowBe4.jpg",
        "jobTitle": "Software Engineer (Position located in Kochi, India)",
        "location": "Kochi, India",
        "jobType": "Full Time",
        "hasRemote": true,
        "easyApply": false,
        "published": "2024-07-03T12:07:30Z",
        "description": "<p><strong>About KnowBe4</strong></p>\n<p><span>KnowBe4, the provider of the world's largest security awareness training and simulated phishing platform, is used by tens of thousands of organizations around the globe. KnowBe4 enables organizations to manage the ongoing problem of social engineering by helping them train employees to make smarter security decisions, every day.</span></p>\n<p><span>Fortune has ranked us as a best place to work for women, for millennials, and in technology for four years in a row! We have been certified as a \"Great Place To Work\" in 8 countries, plus we've earned numerous other prestigious awards, including Glassdoor's Best Places To Work.</span></p>\n<p><span>Our team values radical transparency, extreme ownership, and continuous professional development in a welcoming workplace that encourages all employees to be themselves. Whether working remotely or in-person, we strive to make every day fun and engaging; from team lunches to trivia competitions to local outings, there is always something exciting happening at KnowBe4.</span></p><p></p>\n<p><span><strong><em>Please submit your resume in English.</em></strong></span></p>\n<p>This individual in this role is responsible for developing new and exciting products for KnowBe4’s customers, alongside other engineers in a fast-paced, agile development environment.</p>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Develops software using the KnowBe4 Software Development Lifecycle and Agile Methodologies</li>\n<li>Learn, adapt and implement the cutting edge AWS cloud technologies for KnowBe4’s security awareness platform.</li>\n<li>Recommends solutions to engineering problems</li>\n<li>Defines approaches and solutions to complex technical problems</li>\n</ul>\n<strong>Requirements:</strong>\n<ul>\n<li>3+ Years’ experience as backend cloud developer for the enterprise-grade cloud platform.</li>\n<li>Should have extensive experience with building and integrating REST-based APIs with best practices of authentication &amp; authorization in enterprise-grade production environments.</li>\n<li>Experience with building apps and microservices on the AWS platform using Python</li>\n<li>Expert knowledge in at least one of the web framework technologies like <strong>Python Django</strong> or <strong>Flask.</strong></li>\n<li>Experience in AWS backend technologies like <strong>EC2, S3, Lambda, SNS etc.</strong></li>\n<li>Expertise in databases such as MYSQL/POSTGRES, DynamoDB and elastic search.</li>\n<li>Experience with continuous delivery and integration pipelines: <strong>Docker/Gitlab/Terraform</strong> and other Automated deployment and testing tools.</li>\n</ul>\n<p><strong>Nice to Have: </strong></p>\n<ul>\n<li>Understanding and experience in building software systems following software design principles.</li>\n<li>Demonstrable knowledge of fundamental cloud concepts around multi-tenancy, scaling out, and serverless.</li>\n<li>Working experience in writing clean, unit-tested, and secure code.</li>\n<li>Should be open to learning new technologies &amp; programming languages as and when needed.</li>\n<li>Experience in working with APIs in the cybersecurity industry, and understanding the basics of the current security landscape (attack frameworks, security log processing, basic knowledge of AV/EDR/DLP/CASB, etc.) is a huge plus.</li>\n<li>Experience building scalable data processing pipelines is a plus.</li>\n</ul>\n<p><strong>Our Fantastic Benefits</strong></p>\n<p><span>We offer company-wide monthly bonuses, employee referral bonuses, 401k matching (US), fully paid medical insurance (US), open/generous paid time off (length varies by country), parental leave (length varies by country), adoption assistance, tuition reimbursement, certification reimbursement, certification completion bonuses, gym benefits, and a relaxed dress code - all in a modern, high-tech, and fun work environment. For more details about our benefits, visit </span><a href=\"http://www.knowbe4.com/careers/benefits\"><span>www.knowbe4.com/careers/benefits</span></a><span>.</span></p>\n<p><em><span>Note: An applicant assessment and background check may be part of your hiring procedure.</span></em></p>\n<p><strong>Individuals seeking employment at KnowBe4 are considered without prejudice to race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, gender identity, sexual orientation or any other characteristic protected under applicable federal, state, or local law. If you require reasonable accommodation in completing this application, interviewing, completing any pre-employment testing, or otherwise participating in the employee selection process, please visit www.knowbe4.com/careers/request-accommodation.</strong></p>\n<p><span>No recruitment agencies, please.</span></p>",
        "applicationUrl": "https://boards.greenhouse.io/knowbe4/jobs/7467738002",
        "language": "en",
        "clearanceRequired": false,
        "salaryCurrency": "10 LPA",
        "jobVacancies": 9,
        "companyWebsiteUrl": "https://www.knowbe4.com/",
        "companyLinkedinUrl": "https://www.linkedin.com/company/knowbe4",
        "companyRating": 4.1,
        "companyLocation": "Kochi, India",
        "companySize": 155,
        "industry": "Aerospace",
        "companyDescription": "The aerospace industry designs, manufactures, and maintains aircraft, spacecraft, and related systems and equipment, enabling air travel and space exploration."
    },
    {
        "companyName": "KnowBe4, Inc.",
        "iconUrl": "https://jobdataapi.com/media/company/logo/22/03/KnowBe4.jpg",
        "jobTitle": "Data Architect (Position located in Bengaluru, India)",
        "location": "Bengaluru, India",
        "jobType": "Full Time",
        "hasRemote": true,
        "easyApply": false,
        "published": "2024-07-03T12:07:07Z",
        "description": "<p><strong>About KnowBe4</strong></p>\n<p><span>KnowBe4, the provider of the world's largest security awareness training and simulated phishing platform, is used by tens of thousands of organizations around the globe. KnowBe4 enables organizations to manage the ongoing problem of social engineering by helping them train employees to make smarter security decisions, every day.</span></p>\n<p><span>Fortune has ranked us as a best place to work for women, for millennials, and in technology for four years in a row! We have been certified as a \"Great Place To Work\" in 8 countries, plus we've earned numerous other prestigious awards, including Glassdoor's Best Places To Work.</span></p>\n<p><span>Our team values radical transparency, extreme ownership, and continuous professional development in a welcoming workplace that encourages all employees to be themselves. Whether working remotely or in-person, we strive to make every day fun and engaging; from team lunches to trivia competitions to local outings, there is always something exciting happening at KnowBe4.</span></p><p></p>\n<p><span><strong><em>Please submit your resume in English.</em></strong></span></p>\n<p>This individual provides hands-on architecture leadership, guidance and mentoring to our engineering and data science teams, is a close collaborator and trusted advisor to the VP of Engineering, and ensures the delivery of high-quality, robust, and scalable solutions.</p>\n<p>In addition, this individual is a key technology leader within the company, and provides oversight and strategic direction to the KnowBe4 Leadership Team for building the next generation security awareness products and platforms.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Provide Architectural leadership and technical vision for Knowbe4 products and services</li>\n<li>Develop and maintain architectural roadmaps for products and services and ensure they align with business goals and objectives</li>\n<li>Drive innovation and collaboration across product lines and stakeholders</li>\n<li>Direct and participate in proof of concept implementations.</li>\n<li>Develop strategies to meet business needs and articulate technology solutions</li>\n<li>Direct and participate in proof of concept implementations.</li>\n<li>Delivery of high-quality, robust, and scalable architectural solutions.</li>\n<li>Perform architectural research and produce designs for product features or new services.</li>\n<li>Develop strategies to meet business needs and articulate technology solutions</li>\n<li>Drive innovation and collaboration across product lines and stakeholders</li>\n<li>Develop and maintain architectural roadmaps for products and services and ensure they align with business goals and objectives</li>\n</ul>\n<p><strong>Skills:</strong></p>\n<ul>\n<li>BS Degree plus 10 years experience </li>\n<li>MS Degree plus 8 years experience</li>\n<li>Ph.D. or equivalent plus 5 years experience</li>\n<li>Minimum 5 Years of experience in enterprise software development with focus on cyber security management</li>\n<li>Minimum 2 Years of experience in senior engineering leadership roles influencing product management and development</li>\n<li>Hands on experience in building and scaling distributed services-based web platforms</li>\n<li>Experience with any modern programming/scripting languages such as python, javascript etc. Can participate in code reviews and provide intelligent commentary</li>\n<li>Excellent communication &amp; presentation skills</li>\n</ul><p><strong>Our Fantastic Benefits</strong></p>\n<p><span>We offer company-wide monthly bonuses, employee referral bonuses, 401k matching (US), fully paid medical insurance (US), open/generous paid time off (length varies by country), parental leave (length varies by country), adoption assistance, tuition reimbursement, certification reimbursement, certification completion bonuses, gym benefits, and a relaxed dress code - all in a modern, high-tech, and fun work environment. For more details about our benefits, visit </span><a href=\"http://www.knowbe4.com/careers/benefits\"><span>www.knowbe4.com/careers/benefits</span></a><span>.</span></p>\n<p><em><span>Note: An applicant assessment and background check may be part of your hiring procedure.</span></em></p>\n<p><strong>Individuals seeking employment at KnowBe4 are considered without prejudice to race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, gender identity, sexual orientation or any other characteristic protected under applicable federal, state, or local law. If you require reasonable accommodation in completing this application, interviewing, completing any pre-employment testing, or otherwise participating in the employee selection process, please visit www.knowbe4.com/careers/request-accommodation.</strong></p>\n<p><span>No recruitment agencies, please.</span></p>",
        "applicationUrl": "https://boards.greenhouse.io/knowbe4/jobs/7086129002",
        "language": "en",
        "clearanceRequired": true,
        "salaryCurrency": "10 LPA",
        "jobVacancies": 13,
        "companyWebsiteUrl": "https://www.knowbe4.com/",
        "companyLinkedinUrl": "https://www.linkedin.com/company/knowbe4",
        "companyRating": 4.1,
        "companyLocation": "Bengaluru, India",
        "companySize": 62,
        "industry": "Insurance",
        "companyDescription": "The insurance industry provides risk management through the transfer and pooling of risks, offering protection against financial loss for individuals and businesses."
    },
    {
        "companyName": "Coupang",
        "iconUrl": "https://jobdataapi.com/media/company/logo/22/04/Coupang.jpg",
        "jobTitle": "Staff Data Engineer",
        "location": "Bengaluru",
        "jobType": "Full Time",
        "hasRemote": true,
        "easyApply": true,
        "published": "2024-07-03T12:06:20Z",
        "description": "<p><strong>About the Company :</strong></p>\n\nAt Coupang we are building the future of ecommerce. Born out of an obsession to make shopping, eating, and living easier than ever, we’re collectively disrupting the multi-billion-dollar e-commerce industry fromthe ground up. We exist to wow our customers. We know we’re doing the right thing when we hear ourcustomers say, “How did we ever live without Coupang?” We are one of the fastest-growing e-commerce companies that established an unparalleled reputation for being a dominant and reliable force in South Korean commerce.\n<br/>We are proud to have the best of both worlds — a startup culture with the resources of a large global public company. This fuels us to continue our growth and launch new services at the speed we have been at since our inception. We are all entrepreneurial surrounded by opportunities to drive new initiatives and innovations. At our core, we are bold and ambitious people who like to get our hands dirty and make a hands-on impact. At Coupang, you will see yourself, your colleagues, your team, and the company <br/>grow every day.\n \nOur mission to build the future of commerce is real. We push the boundaries of what’s possible to solve problems and break traditional tradeoffs. Join Coupang now to create an epic experience in this always - on, high-tech, and hyper-connected world.\n \n<strong>About the Role :</strong>\n<p><span>As a Staff Data Engineer for the Core Data and Ingestion team, you will be responsible for the Architecting, design, and development of the Data Ingestion, Data Lake, Data Warehouse, and Data Marts to enable data-driven decision-making across different organizations at Coupang. </span><span> </span></p>\n<p><span>In this role, you will be responsible to work across business domains to understand their business needs, work with Big Data Infrastructure to Architect/Design the reliable and scalable data products which process tera bytes of data each day and enable our customers to make reliable and fast business decisions. At this scale, you will need to ensure fault tolerance and robustness to deliver accurate results on time.</span><span> </span></p>\n<p><strong><span>What You Will Do :</span></strong></p>\n<ul>\n<li><span>Serve as a technical expert and exert technical influence over a team, increasing their productivity and effectiveness by sharing your deep knowledge and experience. </span><span> </span></li>\n<li><span>Work closely with Business analyst across business domains, identify their data needs, identify core KPI’s to drive business growth, Influence source data producers to log key attributes.</span></li>\n<li>Define foundational core data models across different business domains such as search, finance, accounting, advertising, marketing, warehouse management systems etc. <span> </span></li>\n<li>Design and build Coupang's next generation Data Lake, and Data Warehouse.</li>\n<li>Design and build reliable data pipelines using modern distributed processing technologies such as Spark, Streaming, Iceberg, and Hive with the ability to scale very large data volumes.</li>\n<li>Experience driving Master data management practices from producer/source to consumer/data warehouse.</li>\n<li>Foster, mentor, and enforce industry best practices in data architecture, design patterns, big data platform, storage, distributed compute and coding standard.  <span> </span></li>\n</ul>\n<p><strong><span> </span><span>Basic Qualifications :</span></strong></p>\n<ul>\n<li><span>Bachelor's degree and/or Master's degree in Computer Science or equivalent. </span><span> </span></li>\n<li><span>8+ years of experience working on Bigdata with deep understanding of data modeling, data architecture, and data warehousing.</span></li>\n<li>Strong hands-on experience in distributed processing using Scala/Spark, PySpark, and Hive.</li>\n<li>Extensive experience Bigdata Platform, Data Warehousing concepts and languages (SQL, NoSQL) and MPP database such as Redshift.</li>\n<li>Problem solver, Pragmatic and Open-minded.</li>\n<li>Experience with handling large data volumes in a distributed environment.</li>\n<li>Hands on experience with AWS Cloud Computing platforms and understanding of scalability and reliability issues.</li>\n<li>Hands-on experience in one or more programming languages such as Java, Scala, Python or similar languages.</li>\n<li>Experience in collaborating with cross-functional teams to define mission, vision, and roadmaps <span> </span></li>\n</ul>\n<p><strong><span>Preferred Qualifications :</span><span> </span><span> </span></strong></p>\n<ul>\n<li><span>Experience in e-commerce Data products. </span><span> </span></li>\n<li><span>Experience of using large-scale distributed infrastructures for data processing (e.g., Kafka, EMR, Spark on Kubernetes, Redis, Hive/Spark on Hadoop).</span></li>\n<li>Experience in event based Near Real Time (NRT) data ingestion/processing.</li>\n<li>Familiarity with workflow or orchestration frameworks, open-source tools like Airflow and Luigi or commercial enterprise tools. Knowledge of container services (Docker/Kubernetes) is a plus. <span> </span></li>\n</ul>\n<p><strong>Equal Opportunities for All</strong></p>\n<p>Coupang is an equal opportunity employer. Our unprecedented success could not be possible without the valuable inputs of our globally diverse team.</p>\n<p> </p>",
        "applicationUrl": "https://www.coupang.jobs/en/jobs/?gh_jid=6087641",
        "language": "en",
        "clearanceRequired": false,
        "salaryCurrency": "10 LPA",
        "jobVacancies": 7,
        "companyWebsiteUrl": "https://www.coupang.jobs/",
        "companyLinkedinUrl": "https://www.linkedin.com/company/coupang/",
        "companyRating": 3,
        "companyLocation": "Bengaluru",
        "companySize": 74,
        "industry": "Real Estate",
        "companyDescription": "The real estate industry deals with the buying, selling, and leasing of properties, including residential, commercial, and industrial real estate, influencing urban development."
    },
    {
        "companyName": "NielsenIQ",
        "iconUrl": "https://jobdataapi.com/media/company/logo/22/10/NielsenIQ.jpg",
        "jobTitle": "Engineer",
        "location": "Pune, India",
        "jobType": "Full Time",
        "hasRemote": true,
        "easyApply": true,
        "published": "2024-07-03T12:04:17Z",
        "description": "<h3>Job Description</h3><p>Our NielsenIQ Technology teams are working on revamping multiple platform, a unified, global, open data ecosystem powered by Microsoft Azure. Our clients around the world rely on NielsenIQ’s data and insights to innovate and grow. </p><p>As a Backend Software Engineer, you’ll be part of a team of smart, highly skilled technologists who are passionate about learning and prototyping cutting-edge technologies. Right now our CDAR platform is concentrating on application convergence with latest backend services with Spring boot technologies and leverage Jenkins to support things like CI/CD and integrations. Java 8 is primarily used to extend platform features along with continuing to adopt the best in class cloud-native, cloud-agnostic technologies. Our team is co-located and agile, with central technology hubs in Chicago, Madrid, Toronto, Chennai and Pune </p><p><strong>Responsibilities</strong></p><ul><li>Understanding user needs and how they fit into the overall, global solution design </li><li>Configuring &amp; Implementing Application and Integration Service to support Business needs </li><li>Prototyping new features and integrations aligned to business strategy by introducing innovation through technology  </li><li>Following source &amp; test-driven development best practices </li><li>Troubleshooting and identifying root cause analysis while resolving the issues </li></ul><p> </p><p> </p><ul><li> </li></ul><h3>Qualifications</h3><ul><li>Minimum of <strong>4-7</strong> years of experience as a Backend engineer who works on Java frameworks like Spring boot, Spring Integration, Hibernate, Java POJO.</li><li>Development experience in unit and integration test cases like JUnit</li><li>Intermediate level of Database (SQL) skills to develop SQL queries, function and stored procedures. </li><li>Good Understanding on CI/CD Pipeline i.e. Jenkin </li><li>Strong knowledge of version control tools, preferably Bit bucket </li><li>Basic Knowledge on Linux/Unix environment (basic commands, shell scripting, etc.) </li><li>Demonstrated ability to thrive in an enterprise Agile/SCRUM  environment </li><li>Demonstrated ability to work as part of a Global Team </li><li>Strong troubleshooting and problem-solving skills </li><li>Excellent English communication skills, with the ability to effectively interface across cross-functional technology teams and the business  </li><li>Minimum B.S. degree in Computer Science, Computer Engineering or related field </li><li>Experience using  Collaboration Technologies: Azure DevOps, TFS, Jira, Confluence </li><li>Experience using Object-oriented languages Java </li><li>Experience using Atlassian tool suite, including JIRA, Confluence, BitBucket </li><li>Experience working with testing tools and Automation test needs </li><li>Motivated, high-potential performer, with demonstrated ability to influence and lead. </li><li>Strong communicator with excellent interpersonal skills. </li><li>Able to solve complex problems and successfully manage ambiguity and unexpected change. </li><li>Teachable and embracing of best practices and feedback as a means of continuous improvement. </li><li>Consistently high achiever marked by perseverance, humility and a positive outlook in the face of challenges. </li></ul><h3>Additional Information</h3><p><strong>Our Benefits</strong></p><ul><li>Flexible working environment</li><li>Volunteer time off</li><li>LinkedIn Learning</li><li>Employee-Assistance-Program (EAP)</li></ul>\n<p><strong>About NIQ</strong></p><p>NIQ is the world’s leading consumer intelligence company, delivering the most complete understanding of consumer buying behavior and revealing new pathways to growth. In 2023, NIQ combined with GfK, bringing together the two industry leaders with unparalleled global reach. With a holistic retail read and the most comprehensive consumer insights—delivered with advanced analytics through state-of-the-art platforms—NIQ delivers the Full View™. NIQ is an Advent International portfolio company with operations in 100+ markets, covering more than 90% of the world’s population.</p><p>For more information, visit NIQ.com</p><p>Want to keep up with our latest updates?</p><p>Follow us on: <a href=\"https://www.linkedin.com/company/nielseniq/mycompany/\">LinkedIn</a> | <a href=\"https://www.instagram.com/nielseniq/\">Instagram</a> | <a href=\"https://twitter.com/nielseniq\">Twitter</a> | <a href=\"https://www.facebook.com/NielsenIQ.global/\">Facebook</a></p>\n<p><strong>Our commitment to Diversity, Equity, and Inclusion</strong></p><p>NIQ is committed to reflecting the diversity of the clients, communities, and markets we measure within our own workforce. We exist to count everyone and are on a mission to systematically embed inclusion and diversity into all aspects of our workforce, measurement, and products. We enthusiastically invite candidates who share that mission to join us. We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, protected veteran status or any other protected class. Our global non-discrimination policy covers these protected classes in every market in which we do business worldwide. Learn more about how we are driving diversity and inclusion in everything we do by visiting the NIQ News Center: <a href=\"https://nam02.safelinks.protection.outlook.com/?url=https%3A%2F%2Fnielseniq.com%2Fglobal%2Fen%2Fnews-center%2Fdiversity-inclusion&amp;data=05%7C02%7CJenny.Rebecca%40nielseniq.com%7C6e534cbe3eb041842d5f08dc6dca121e%7C6ac7a1f45fb14153bb4f12d2020a1f7d%7C0%7C0%7C638505961881417602%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C0%7C%7C%7C&amp;sdata=B%2Fp40oNUpJOw1CNoc87EFXk%2BvxeO1jxYOSRCEKM%2Fz5Q%3D&amp;reserved=0\">https://nielseniq.com/global/en/news-center/diversity-inclusion</a></p>",
        "applicationUrl": "https://jobs.smartrecruiters.com/NielsenIQ/743999998152985-engineer",
        "language": "en",
        "clearanceRequired": false,
        "salaryCurrency": "10 LPA",
        "jobVacancies": 5,
        "companyWebsiteUrl": "https://nielseniq.com",
        "companyLinkedinUrl": "https://www.linkedin.com/company/nielseniq/",
        "companyRating": 2.8,
        "companyLocation": "Pune, India",
        "companySize": 180,
        "industry": "Logistics",
        "companyDescription": "The logistics industry manages the flow of goods from point of origin to point of consumption, including warehousing, transportation, and inventory management."
    },
    {
        "companyName": "Nagarro",
        "iconUrl": "https://jobdataapi.com/media/company/logo/22/10/7fKE8FL9_400x400.png",
        "jobTitle": "Associate Distinguished Engineer, Technology (BFSI Architect)",
        "location": "Remote, India",
        "jobType": "Full Time",
        "hasRemote": false,
        "easyApply": true,
        "published": "2024-07-03T11:59:35Z",
        "description": "<h3>Company Description</h3><p><strong>👋🏼We're Nagarro</strong></p><p>We are a Digital Product Engineering company that is scaling in a big way! We build products, services, and experiences that inspire, excite, and delight. We work at scale — across all devices and digital mediums, and our people exist everywhere in the world (18000+ experts across 36 countries, to be exact). Our work culture is dynamic and non-hierarchical. We're looking for great new colleagues. That's where you come in.</p><h3>Job Description</h3><p><strong>LOCATIONS: </strong>Gurgaon/ Noida/ Pune/ Jaipur/ Bangalore/ Hyderabad</p><p><strong>REQUIREMENTS:</strong></p><ul><li>Experience: 14+yrs</li><li>Enterprise Architect with in-depth knowledge of the BFSI domain, combined with robust technology expertise and responsible for evaluating internal functions, business development strategies, and IT processes, suggesting improvements to enhance efficiency.</li><li>This role involves creating business architecture models that align with the organization’s strategies and goals, implementing business visions, and driving organizational objective along with evaluating systems engineering, talent recruiting, and accounting models for discrepancies and vulnerabilities, and suggesting cost-reduction ideas to IT and business leadership.</li><li>Organize training programs to enhance employees’ knowledge and skills for future growth, conduct research in talent management to improve business operations, and provide business architecture and systems processing guidance and ensuring the efficiency, security, and alignment of organizational goals is crucial and creating methods for compliance architecture, such as data storage, metadata management, and change control.</li><li>Hands on experience in designing and developing technology solutions using a variety of platforms, languages, and tools, with at least 5+ years of software architecture experience.</li><li>Ability to think breakthroughs by leveraging new age technologies and a deep understanding of the client’s business and the industry they operate in.</li><li>Ability to lead by example by picking up coding of complex functionalities when required.</li><li>Strong understanding of technology and the ability to deep dive into a technology problem.</li><li>Ability to influence key client stakeholders on their technology and operations strategy.</li><li>Vast experience in owning delivery of complex technology solutions for global clients.</li><li>Ability to multitask and own multiple technology tracks simultaneously in a globally distributed delivery setup.</li><li>Experience in creating cutting edge technology solution by collaborating with other world class technologists</li><li>Balanced approach that aligns technology-based solutions with customer needs.</li><li>Visible thought leadership through technology blogs, whitepapers, presentations etc.</li><li>Fluent verbal and written language skills and ability to convey a message in a simple and structured manner, customized to the audience and to the mode of communication.</li></ul><p><strong>RESPONSIBILITIES:</strong></p><ul><li>Preferred experience of working in all mobile, web and backend solutions.</li><li>Knowledge of Enterprise Architecture Frameworks like TOGAF, Zachman.</li><li>Excellent Solution designing skills identifying the proper technology stack.</li><li>Excellent understanding of Agile practices using Lean, Scrum and Kanban.</li><li>Excellent knowledge of SOA and Microservices architecture pattern encapsulating transaction scenarios.</li><li>Good Problem-Solving Skills and ability to solve problems using innovative approach.</li><li>Ability to create solution design encompassing functional, Logical, Component, Data, Integration, Security and Deployment aspects.</li><li>Have experience in working on all aspects of product lifecycle from Design, development, deployment, DevOps, and continuous integration.</li><li>Defining business requirements as per discussion with various stakeholders.</li><li>Proficiency on design and architecture on Multiple domains and technology stacks</li><li>Ability to work along with teams for technical insights and with customer on technical consulting and solutions.</li><li>Excellent communication skills Proficient and hands on in at least on one technology and able to adapt in providing solutions in different tech stacks.</li><li>Client-centric and a team player Significant exposure in responding to RFPs.</li></ul><h3>Qualifications</h3><p>Bachelor's or Master's degree in computer science, Information Technology, or a related field.</p><h3>Additional Information</h3><p><a href=\"https://www.nagarro.com/hubfs/NagarroWebsiteRedesign-Aug2020/Assets/Docs/Applicant%20Privacy%20Notice-EN.pdf\">Click here to access the application privacy notice</a></p>",
        "applicationUrl": "https://jobs.smartrecruiters.com/Nagarro1/743999998148626-associate-distinguished-engineer-technology-bfsi-architect-",
        "language": "en",
        "clearanceRequired": true,
        "salaryCurrency": "10 LPA",
        "jobVacancies": 4,
        "companyWebsiteUrl": "https://www.nagarro.com",
        "companyLinkedinUrl": "https://www.linkedin.com/company/nagarro",
        "companyRating": 2,
        "companyLocation": "Remote, India",
        "companySize": 84,
        "industry": "Media",
        "companyDescription": "The media industry produces and distributes news, information, and entertainment content through various platforms, including print, television, radio, and digital media."
    },
    {
        "companyName": "insightsoftware",
        "iconUrl": "https://jobdataapi.com/media/company/logo/22/10/insightsoftware.jpg",
        "jobTitle": "Software Engineer (C++, STL, OOPS, Design Patterns)",
        "location": "Bengaluru, India",
        "jobType": "Full Time",
        "hasRemote": false,
        "easyApply": true,
        "published": "2024-07-03T11:56:45Z",
        "description": "<h3>Company Description</h3><p>Insightsoftware is a growing, dynamic software company that helps businesses achieve greater levels of financial intelligence across their organization with our world-class financial reporting solutions. At Insightsoftware, you will learn and grow in a fast-paced, supportive environment that will take your career to the next level. We are looking for future Insighters who can demonstrate teamwork, results orientation, a growth mindset, disciplined execution, and a winning attitude to join our growing team.</p><h3>Job Description</h3><p>We are looking for a C++ Software Engineer for our software development team.  Apart from writing high quality code, you will be responsible for key deliverables during your team’s software development lifecycle including software design, code reviews, and comprehensive automated tests. The successful candidate will have a passion for continuous improvement and must have excellent written and verbal communication skills. You will also be writing Java code for connectivity solutions.<br/>\n<br/>\n <strong>Desired Skills:</strong></p><ul><li>Driving Sprint Planning and breakdown of tasks.</li><li>Contributing to performance testing &amp; various continuous improvement efforts.</li><li>Strong OS, Data structure and Algorithms fundamentals</li><li>Strong hold on object-oriented programming concepts and their implementation through C++.</li><li>Experience developing database technologies extremely valuable</li><li>Experience with low-level C and networking is desired, but not necessary.</li><li>Experience programming database APIs such as ODBC and using database tools strongly preferred</li><li>Experience using BI tools such Tableau, Microsoft Power BI and Lumira desirable but not mandatory.</li><li>Experience using any memory and performance profiling tools is required</li><li>Experience working with Agile methodology i.e Participating in all team activities, including sprint retrospectives, thoughtful code reviews, knowledge sharing sessions, status reporting for project stakeholders, etc</li></ul><h3>Qualifications</h3><p><strong>Qualifications</strong></p><ul><li>Bachelor’s degree with minimum 3 years of related experience or Equivalent work experience.</li><li>Programming experience including but not limited to C++ technologies</li><li>A good understanding of database concepts (e.g. working with relational data sources such as MySQL, SQL Server, Oracle, etc.) and SQL queries</li><li>Experience with such products and tools as Bamboo (Atlassian), Visual Studio Online, Visual Studio, and/or Azure is helpful.</li><li>Ability to lead and mentor others</li><li>Excellent written and verbal communication skills.</li><li>Development experience on a range of operating system platforms such as Windows ( mandatory ) , Linux, and OS X desirable.</li></ul><h3>Additional Information</h3><p>All your information will be kept confidential according to EEO guidelines.</p><p> </p><p>** <strong>At this time insightsoftware is not able to offer sponsorship to candidates who are not eligible to work in the country where the position is located</strong>. **</p>\n<p><a href=\"https://insightsoftware.wistia.com/medias/vzk90oshuy\">insightsoftware About Us: Hear From Our Team - InsightSoftware (wistia.com)</a></p>\n<p>Background checks are required for employment with insightsoftware, where permitted by country, state/province.</p>\n<p>At insightsoftware, we are committed to equal employment opportunity regardless of race, color, ethnicity, ancestry, religion, national origin, gender, sex, gender identity or expression, sexual orientation, age, citizenship, marital or parental status, disability, veteran status, or other class protected by applicable law. We are proud to be an equal opportunity workplace.</p>",
        "applicationUrl": "https://jobs.smartrecruiters.com/Insightsoftware/743999998151415-software-engineer-c-stl-oops-design-patterns-",
        "language": "en",
        "clearanceRequired": false,
        "salaryCurrency": "10 LPA",
        "jobVacancies": 12,
        "companyWebsiteUrl": "https://insightsoftware.com/",
        "companyLinkedinUrl": "https://www.linkedin.com/company/outcomes-by-insightsoftware",
        "companyRating": 3,
        "companyLocation": "Bengaluru, India",
        "companySize": 57,
        "industry": "Public Sector",
        "companyDescription": "The public sector includes government services and organizations that provide public services, such as education, healthcare, defense, and infrastructure development."
    },
    {
        "companyName": "Avery Dennison",
        "iconUrl": "https://jobdataapi.com/media/company/logo/22/10/ttRn5cWv_400x400.png",
        "jobTitle": "Regional Data Lead - APAC",
        "location": "Gurgaon, India",
        "jobType": "Full Time",
        "hasRemote": true,
        "easyApply": false,
        "published": "2024-07-03T11:48:20Z",
        "description": "<h3>Company Description</h3><p>ABOUT AVERY DENNISON CORPORATION</p><p>Avery Dennison Corporation (NYSE: AVY) is a global materials science and digital identification solutions company that provides a wide range of branding and information solutions that optimize labor and supply chain efficiency, reduce waste, advance sustainability, circularity, and transparency, and better connect brands and consumers. Our products and solutions include labeling and functional materials, radio frequency identification (RFID) inlays and tags, software applications that connect the physical and digital, and a variety of products and solutions that enhance branded packaging and carry or display information that improves the customer experience. Serving an array of industries worldwide — including home and personal care, apparel, general retail, e-commerce, logistics, food and grocery, pharmaceuticals, and automotive — we employ approximately 35,000 employees in more than 50 countries. Our reported sales in 2023 were $8.4 billion. Learn more at <a href=\"http://www.averydennison.com\">www.averydennison.com</a>.</p><p> </p><ul><li><p>AVERY DENNISON IS PROUD TO BE CERTIFIED GREAT PLACE TO WORK IN<a href=\"https://greatplacetowork.com.au/companies/avery-dennison-australia/\"> AUSTRALIA</a>, <a href=\"https://greatplacetowork.cn/ch/certified-companies/showprofile/?tok=315D53FFB91644568F29451EA74DF8F38FCE81E4FD7046D79649C47D0E157D42C7F8E9567D4D451D9215E1164FF9F57D&amp;lang=ZH2\">CHINA</a>, <a href=\"https://www.greatplacetowork.in/great/company/avery-dennison-india-pvt-ltd\">INDIA</a>, <a href=\"https://hatarakigai.info/ranking/certified_companies/0331_1029.html\">JAPAN</a>,<a href=\"https://greatplacetowork.com.sg/companies/avery-dennison-singapore-pte-ltd/\"> SINGAPORE</a>, <a href=\"https://greatplacetowork.com.sg/companies/avery-dennison-materials-sdn-bhd/\">MALAYSIA</a>, <a href=\"https://greatplacetowork.com.sg/companies/avery-dennison-thailand-ltd/\">THAILAND</a>, AND <a href=\"https://greatplacetowork.com.vn/companies/avery-dennison-vietnam/\">VIETNAM</a>, AND RECOGNIZED AS ONE OF THE BEST COMPANIES TO WORK FOR IN ASIA IN<a href=\"https://hr.asia/awards/2023-event/china2023/avery-dennison-china-cn-2023/\"> GREATER CHINA</a> AND<a href=\"https://hr.asia/awards/2023-event/vietnam2023/avery-dennison-vietnam-vn-2023/\"> VIETNAM</a>.</p></li></ul><h3>Job Description</h3><p>ABOUT YOUR ROLE </p><ul><li><p>Play a pivotal role in extracting insights from complex data set to support  digital strategies</p></li><li><p>Lead teams that analyze trends, performance metrics, customer behavior, providing a data driven foundation for decision making and measuring impact of digital initiatives </p></li><li><p>This role is full-time and requires a high level of commitment and understanding of data analytics and data management.</p></li><li><p>Coordinate cross-functional teams, manage resources and maintain clear communication channels to keep digital transformation and data projects aligned with business objectives.</p></li><li><p>Oversees execution and ROI outcomes of various digital initiatives in addition to data related projects</p></li><li><p>This role is required to keep abreast of industry news and trends about emerging technologies</p></li><li><p>Exposure to Oracle fusion would be preferred ( FAW/OAC etc)</p></li></ul><p><br/>\n </p><p>YOUR RESPONSIBILITIES WILL INCLUDE:</p><p> </p><ul><li><p>Leads team of data scientists/data analysts and execute projects to produce business deliverables </p></li><li><p>Develop strategies for effective data analysis and reporting</p></li><li><p>Define company-wide metrics and relevant data sources </p></li><li><p>Select, configure, implement analytics solutions</p></li><li><p>Build systems to transform raw data into actionable insights</p></li><li><p>Apply industry knowledge to interpret data and improve performance</p></li><li><p>Analyze large amount of data to derive patterns/trends and thus gain business insights</p></li><li><p>Solving business problems using various logic and creativity</p></li><li><p>Use data visualization and storytelling to create custom reports and presentations </p></li><li><p>Coordinating tasks of teams working on big data projects and and ensuring efficiently completion </p></li><li><p>Coordinating team tasks including research, data collection using effective methods, information analysis and recommendation for business solutions </p></li><li><p>Communicates with cross functional departments and ensure their strategies and goals are aligned with company digital strategies</p></li></ul><p><br/>\n </p><h3>Qualifications</h3><p>WHAT WE WILL BE LOOKING FOR IN YOU:</p><p> </p><ul><li><p>Bachelor’s or postgraduate degree in engineering ( computer science/IT preferred), statistics, data management or related field</p></li><li><p>Proven 10-15 years experience as an Analytics Manager or data scientists</p></li><li><p>Knowledge of excel, SQL, Python and R languages,  Machine learning (ML) techniques  and familiarity with BI tools (e.g. Tableau, SAS)</p></li><li><p>Experience working in cloud based environment (e.g. AWS, GCP etc)</p></li><li><p>Relevant experience in managing the Manufacturing, SCM, Ops etc related projects will be preferred.  </p></li><li><p>Demonstrated ability to collaborate with cross-functional teams to solve problems </p></li><li><p>Strong logical reasoning skills and business intelligence</p></li><li><p>Analytical skills and strong organizational abilities</p></li><li><p>Attention to detail and problem solving aptitude</p></li><li><p>Ability to rapidly and continually engage key resources/stakeholders for their input </p></li><li><p>Appetite for change, desire to optimize digital Transformation.</p></li><li><p>We are looking for individuals who are outstanding communicators,  decisive, resilient and flexible.</p></li><li><p>Proficient in English</p></li><li><p>Open to travel within the APAC regions or outside depending on business needs</p></li><li><p>Previous hands-on experience with operational and analytical BI tools is highly desired e.g. Oracle OTBI, FAW, Cognos, Power BI, Google Data Studio etc. </p></li></ul><h3>Additional Information</h3><p><span>AVERY DENNISON IS AN EQUAL EMPLOYMENT OPPORTUNITY PROVIDER</span></p><p> </p><p>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability, protected veteran status or other protected status. EEOE/M/F/Vet/Disabled. All your information will be kept confidential according to EEO guidelines.</p>",
        "applicationUrl": "https://jobs.smartrecruiters.com/AveryDennison/743999998148478-regional-data-lead-apac",
        "language": "en",
        "clearanceRequired": true,
        "salaryCurrency": "10 LPA",
        "jobVacancies": 8,
        "companyWebsiteUrl": "https://www.averydennison.com/",
        "companyLinkedinUrl": "https://www.linkedin.com/company/avery-dennison/",
        "companyRating": 2.1,
        "companyLocation": "Gurgaon, India",
        "companySize": 160,
        "industry": "Chemical",
        "companyDescription": "The chemical industry produces chemicals and related products used in a wide range of industries, including manufacturing, agriculture, and pharmaceuticals."
    },
    {
        "companyName": "Myntra",
        "iconUrl": "https://jobdataapi.com/media/company/logo/21/08/myntra.jpg",
        "jobTitle": "Associate - Category Management",
        "location": "bengaluru",
        "jobType": "Full Time",
        "hasRemote": false,
        "easyApply": true,
        "published": "2024-07-03T11:41:20Z",
        "description": "<p><strong>Role – Associate</strong></p>\n<p><strong>Team – Footwear</strong></p>\n<p><strong>Location : Bangalore </strong></p>\n<p><strong>Roles &amp; Responsibilities</strong></p>\n<p>∙ Work closely with the Key Internal stakeholders to drive the business for FTW BUs in the relevant categories with focus on growth and increasing the market share.<br/>∙ Manage relationships with brand partners &amp;amp; establish Myntra as the preferred destination for customers as well as brand partners.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>KAM for key marketplace brands &amp; managing relationships &amp; JBP with them</li>\n<li> Intake / OTB management - Monitor inventory situation &amp; plan inwards based on the DOH plan &amp; plan timely RTVs.</li>\n<li>Selection – making season level buy plans / assortment plans, based on past performance, growth /revenue targets to ensure that the category is well represented.</li>\n<li>Review style level performance based on metrics such as ROS, Sell thru, RPI, RGM</li>\n<li>Category visibility, planning interventions – planning banners for respective brands and raising banner requests on time.</li>\n<li>Identify gaps in product offerings &amp; subsequently introduce / on-board new brands / categories.</li>\n<li>Managing and negotiating pricing and other demand interventions – follow up with brands on securing timely discounts and updating the same, control pricing internally as per planned GM / RGM. Working closely on Demand shaping for the entire portfolio</li>\n<li>Be an effective bridge between brands and internal teams for all communications.</li>\n<li>Operational excellence: Should have prior experience or enough knowledge &amp; confidence to manage merchandising operations, inbound planning, cataloguing &amp; discount monitoring.</li>\n<li><strong>Qualifications &amp; Experience</strong><br/>∙ Bachelor’s degree from a reputed School; Fashion/Footwear degree preferrable<br/>∙ The ideal candidate would be should have an experience of minimum 3 years and can independently     handle a part of the larger portfolio. <br/>∙ Hands on experience with analyzing data and making forecasts.<br/>∙ Analytical and critical thinker.<br/>∙ Excellent communication, presentation and interpersonal skills.<br/>∙ <strong>Sound MS Excel Skills a Must.</strong></li>\n</ul>",
        "applicationUrl": "https://boards.greenhouse.io/myntra/jobs/7522251002",
        "language": "en",
        "clearanceRequired": false,
        "salaryCurrency": "10 LPA",
        "jobVacancies": 8,
        "companyWebsiteUrl": "https://www.myntra.com/",
        "companyLinkedinUrl": "https://www.linkedin.com/company/myntra/",
        "companyRating": 2.3,
        "companyLocation": "bengaluru",
        "companySize": 196,
        "industry": "E-commerce",
        "companyDescription": "The e-commerce industry involves the buying and selling of goods and services over the internet, transforming traditional retail and enabling global trade."
    },
    {
        "companyName": "CommerceIQ",
        "iconUrl": "https://jobdataapi.com/media/company/logo/23/04/commerceIQ1.png",
        "jobTitle": "Lead Machine Learning Engineer",
        "location": "Bengaluru, Karnataka, India",
        "jobType": "Full Time",
        "hasRemote": false,
        "easyApply": true,
        "published": "2024-07-03T11:40:20Z",
        "description": "<p><strong>Company Overview</strong></p>\n<p>At CommerceIQ, we help consumer brands accelerate their retail ecommerce market share growth and profitability through machine learning algorithms. We are building the world’s most complete and sophisticated Retail Ecommerce Management Platform, which connects and intelligently automates the management of retail ecommerce channels like Amazon, Walmart, and Instacart, across the entire ecommerce operational chain of retail media management, sales operations, supply chain, and digital self analytics.</p>\n<p>We are in hyper growth mode, having recently raised our <a href=\"https://commerceiq.ai/press-releases/commerceiq-secures-115-million-investment-from-softbank-vision-fund-2-at-unicorn-valuation-to-revolutionize-retail-ecommerce-management/\" target=\"_blank\">Series D funding at unicorn valuation (&gt;$1B)</a> and ended our third year of triple-digit revenue growth. Continued acceleration of our growth is fueled by landing new customers, expanding our platform through new products, managing new retail ecommerce platforms, and delivering exceptional customer service to unlock high net retention rates.</p><p><strong>Company Overview</strong></p>\n<p>At CommerceIQ, we help consumer brands accelerate their retail ecommerce market share growth and profitability through machine learning algorithms. We are building the world’s most complete and sophisticated Retail Ecommerce Management Platform, which connects and intelligently automates the management of retail ecommerce channels like Amazon, Walmart, and Instacart, across the entire ecommerce operational chain of retail media management, sales operations, supply chain, and digital self analytics.</p>\n<p>We are in hyper growth mode, having recently raised our Series D funding at unicorn valuation (&gt;$1B) and ended our third year of triple-digit revenue growth. Continued acceleration of our growth is fueled by landing new customers, expanding our platform through new products, managing new retail ecommerce platforms, and delivering exceptional customer service to unlock high net retention rates.</p>\n<p><strong>What You’ll Be Doing</strong></p>\n<p>As a Lead ML Engineer in the Data Science team, you will work closely with the engineering, product, and operations teams to build state-of- the-art ML based solutions for B2B SaaS products. This will entail applying advanced ML algorithms at scale for core products and developing robust end to end production pipelines which includes Human-in-the-Loop component to boost the quality. </p>\n<p>In this role, you will find innovative ways to apply emerging technologies to improve business processes and drive more value for customers. The ideal candidate will have a strong background in machine learning model development, natural language processing and understanding, and data analysis which they can utilize to manage and improve our company’s AI/ML initiatives. </p>\n<ul>\n<li>Architect and Own multiple AI driven end to end pipelines that allows for deployment and scalability of machine learning models</li>\n<li>Build tools and capabilities that help with data ingestion to feature engineering, data management and organization</li>\n<li>Build tools and capabilities for scalability through distributed optimization </li>\n<li>Deploy  cutting edge algorithms like LLMs etc. on GPUs at scale</li>\n<li>Work with stakeholders on the research and software engineering side of the company to understand how to support their teams</li>\n<li>Build tools and capabilities for model management and model performance monitoring</li>\n<li>Build operating services at scale with high availability and reliability</li>\n<li>Propose and implement the best engineering practices for scaling ML-powered features, with a goal to enable the fast iteration of and efficient experimentation with novel features</li>\n<li>Contribute and influence the ML infrastructure roadmap in collaboration with Data Science team</li>\n</ul>\n<p><strong>What we are looking for -</strong></p>\n<ul>\n<li>Bachelor’s or Masters in Computer Science or Maths/Stats from a reputed college with 5+ years of experience in solving of experience in machine learning engineering problems </li>\n<li>Experience and understanding of the entire machine learning pipeline from data ingestion to production</li>\n<li>Experience with machine learning operations, software engineering, and architecture</li>\n<li>Experience with large-scale systems including parallel computing and GPUs</li>\n<li>Experience architecting and building an AI pipelines that supports productionization of ML models</li>\n<li>Experience with MLOps systems</li>\n<li>Strong programming skills in a scientific computing language such as Python, SQL</li>\n<li>Experience using frameworks for machine learning and data science like scikit-learn, pandas, NumPy</li>\n<li>Experience working with ML tools such as Tensorflow, Keras, and Pytorch</li>\n<li>Ability to take successful, complex research ideas from experimentation to production</li>\n<li>Excellent written and oral communication skills and the capability to drive cross-functional requirements with product and engineering teams</li>\n<li>Good depth and breadth in machine learning (theory and practice), optimization methods, data mining, statistics and linear algebra</li>\n</ul>\n<p><strong>Why you will love to work with us -</strong></p>\n<p>We have multiple brands, which are among the biggest brands operating on amazon, as our customers. You will be responsible for working with their data and developing models and algorithms to drive lift in tune of hundreds of thousands of dollars.</p>\n<ul>\n<li>Opportunity to work on cutting edge technologies in text and images data like LLMs, OCR, transformer based embeddings models</li>\n<li>Deploy code using the most sophisticated tech stack like AWS, GCP etc.</li>\n<li>You will own projects end to end i.e., from exploration to final production</li>\n<li>You will be empowered to make decisions. It implies more responsibilities but high learning</li>\n<li>Immense opportunities to learn and develop ML based SaaS products for brands and get company-wide recognition</li>\n<li>Forget endless meetings. Get things done and start making an impact from day 1</li>\n<li>Work hard, have amazing fun, create history, build the future of eCommerce </li>\n<li>Start-up environment with a strong culture and values to accelerate your career </li>\n</ul>",
        "applicationUrl": "https://boards.greenhouse.io/commerceiq/jobs/6031089003",
        "language": "en",
        "clearanceRequired": false,
        "salaryCurrency": "10 LPA",
        "jobVacancies": 7,
        "companyWebsiteUrl": "https://commerceiq.ai/",
        "companyLinkedinUrl": "https://www.linkedin.com/company/commerceiq/",
        "companyRating": 3.3,
        "companyLocation": "Bengaluru, Karnataka, India",
        "companySize": 186,
        "industry": "Biotechnology",
        "companyDescription": "The biotechnology industry uses biological processes and organisms to develop products and technologies for healthcare, agriculture, and environmental management."
    },
    {
        "companyName": "Aspire",
        "iconUrl": "https://jobdataapi.com/media/company/logo/22/04/AspireSEA.jpg",
        "jobTitle": "Fraud Senior Analyst",
        "location": "India",
        "jobType": "Full Time",
        "hasRemote": true,
        "easyApply": true,
        "published": "2024-07-03T11:37:19Z",
        "description": "<p>Aspire is the leading all-in-one finance operating system for growing businesses in APAC. We are on a mission to reinvent business finance for a new generation of entrepreneurs and business owners, empowering startups and MSME to realise their full potential. </p>\n<p>Founded in 2018, Aspire has raised over <strong>USD 300M+</strong> across equity and debt from world-class investors. In 2023, we successfully closed an oversubscribed <strong>USD 100 million Series C</strong> equity round led by Sequoia Capital and Lightspeed Ventures with participation of Tencent, Paypal Ventures, LGT Capital Partners, Picus Capital and MassMutual Ventures. To power our solutions, we have partnered with some of the best companies in the world such as Visa and Wise and helped more than <strong>15,000 businesses</strong> using our suite of products.</p>\n<p>For 2 consecutive years in 2022 &amp; 2023, Aspire has been awarded Best Employer of the Year and Startup of the year by Asia FinTech Awards, and also LinkedIn’s Top Startup in Singapore. In 2023, we also made it to CB Insights’ Top 100 Global Fintech List. </p>\n<p>You will be amazed by the energy and experience of our team! Aspire serves as an environment for you to innovate and drive change with our team of ex-entrepreneurs, ex-founders, and high-achievers with international and diverse backgrounds.</p>\n<p>Are you a top talent who is passionate about entrepreneurship? Join our rapidly growing team to make an impact in the fintech space! </p><p></p>\n<p><strong>About the team:<br/><br/></strong>At Aspire, we are committed to empowering our customers throughout their journey with us. Our Operations Team ensures customers can operate seamlessly on our platform, and guarantee the best customer experience possible.</p>\n<p> </p>\n<p><strong>About the role:</strong></p>\n<ul>\n<li>Utilize advanced data analytics skills to identify fraud patterns, trends, and outlier indicative of fraudulent behavior with transaction data, user activity, and other relevant datasets</li>\n<li>Manage the alerts generated by fraud detection systems, review and prioritize alerts, monitor the alert accuracy rates and propose the enhancements</li>\n<li>Conduct thorough investigations to verify suspicions, based on the findings from investigations and risk assessments, develop and propose the strategies to prevent future incidents of fraud. </li>\n<li>Evaluate and identify key process/system gaps based on data analysis in order to propose and drive improvements</li>\n<li>Support fraud operation team with new initiatives and projects related to fraud detection and prevention across payment products</li>\n</ul>\n<p><strong>Minimum qualifications:<br/></strong></p>\n<ul>\n<li>At least 3 years of experience working in the payments space, and at least 2 years in a risk/fraud-related role</li>\n<li>Deep understanding and knowledge of card scheme rules, fraud rules, and fraud modules like Visa Risk Manager and MasterCard Decision Intelligence </li>\n<li>Understanding of payment &amp; fraud-related regulations</li>\n<li>Excellent command of English both verbal and written - English is the main language used in the company and with clients/partners</li>\n<li>Comfortable with spreadsheets/formulas, data analysis and visualization (e.g. pivot tables, PowerBI, Tableau)</li>\n<li>Excited to work in a fast-paced startup and ever-evolving environment</li>\n</ul>\n<p></p><p><strong>What we offer</strong></p>\n<ul>\n<li>Uncapped flexible annual leave.</li>\n<li>Hybrid work arrangement. </li>\n<li>Training subsidy for your professional growth.</li>\n<li>Wellness benefit.</li>\n<li>Team bonding budget to foster collaboration and sense of belonging.</li>\n<li>Flexibility to work from anywhere (for up to 90 days per annum).</li>\n<li>Culture is Key: We always strive to cultivate a special culture that brings special talents together - You can learn more about our culture on our <a href=\"https://aspireapp.com/careers\">careers site</a> and <a href=\"https://www.linkedin.com/company/aspire-sea/life/lifeataspire/?viewAsMember=true\">LinkedIn Life page</a>.<strong><br/></strong></li>\n</ul>\n<p><strong>Equal Opportunity Statement </strong></p>\n<p>Aspire is an equal opportunity employer and is committed to providing equal employment opportunities to all qualified individuals without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or any other protected characteristic as outlined by applicable laws. <strong><br/></strong></p>\n<p> </p>\n<p><strong>Please note:</strong> by submitting your application, you acknowledge that you have read and understood Aspire’s <a href=\"https://drive.google.com/file/d/1vLznVZh_G59UpJ2IO0vUyy0dskPf7ZAF/view?usp=sharing\" target=\"_blank\"><em>Data Protection Policy for Employees, Freelancers, Contractors and Job Applicants</em> (the “<strong>Policy</strong>”)</a>, and consent to the collection, use and disclosure of your personal data by Aspire for the purposes set out in the Policy. You may withdraw consent for such collection, use and disclosure, and make an access or correction request in respect of your personal data, in accordance with the Policy by emailing <em><a href=\"mailto:people@aspireapp.co\" target=\"_blank\">people@aspireapp.com</a></em>. </p>",
        "applicationUrl": "https://boards.greenhouse.io/aspire/jobs/5222342004",
        "language": "en",
        "clearanceRequired": false,
        "salaryCurrency": "10 LPA",
        "jobVacancies": 3,
        "companyWebsiteUrl": "https://aspireapp.com/",
        "companyLinkedinUrl": "https://www.linkedin.com/company/aspire-sea",
        "companyRating": 3.5,
        "companyLocation": "India",
        "companySize": 171,
        "industry": "Entertainment",
        "companyDescription": "The entertainment industry produces and distributes content such as movies, television shows, music, and live performances, providing leisure and cultural enrichment."
    },
    {
        "companyName": "Tide",
        "iconUrl": "https://jobdataapi.com/media/company/logo/22/05/TideBusiness.jpg",
        "jobTitle": "Sales Representative",
        "location": "India, Delhi NCR",
        "jobType": "Full Time",
        "hasRemote": true,
        "easyApply": false,
        "published": "2024-07-03T11:36:03Z",
        "description": "<p>Job Title: -Sales Representative</p>\n<p>Location: - Hyderabad</p>\n<p><strong>About Tide</strong></p>\n<p>At Tide, we are building a finance &amp; admin platform designed to save small businesses time and money. We provide our members with business accounts and related banking services, but also a comprehensive set of connected administrative solutions from invoicing to accounting.</p>\n<p>Launched in 2017, Tide is now the leading business financial platform in the UK with 575,000 SME members (10% market share) and more than 250,000 SMEs in India. Headquartered in London, Tide has over 1,800 Tideans across the UK, Bulgaria, India, Serbia, Romania, Ukraine and Germany. </p>\n<p>Tide is rapidly growing, expanding into new markets and always looking for passionate and driven people. Join us in our mission to empower small businesses and help them save time and money.   </p>\n<p><strong>About the team</strong></p>\n<p>As a Sales Representative, you’ll be entrepreneurial, target oriented and passionate about helping small, growing businesses. Working in a fast paced, ever changing environment will excite you along with an interest in the fintech industry and all that we are doing to save small business owners time and money. You’ll be target focused and confident at handling objections to achieve your revenue goals. You’ll also have an excellent telephone manner, will be outgoing and thrive working in a close-knit team. You’ll possess excellent commercial awareness, constantly seeking new opportunities to generate revenue.</p>\n<p><strong>About the role</strong></p>\n<ul>\n<li>Calling our existing members – build rapport with them, understand their businesses and will upsell relevant products or services to help them thrive</li>\n<li>Working cross functionally with other departments to understand upcoming product launches and ensure that you can pitch these to our members</li>\n<li>Working in a dynamic and data driven environment to reach team and individual targets</li>\n<li>Playing a part in testing of new leads/scripts that support the team overall as we work in new areas of the business</li>\n<li>Getting to know these leads/prospective members, and how their businesses plan to operate and will recommend relevant products and services to help them thrive</li>\n<li>Spending time to take on ad hocs tasks and work on projects that support other business areas </li>\n</ul>\n<p><strong>What we are looking for</strong></p>\n<ul>\n<li>You have at least 1 year of previous financial services telesales experience and success working towards a revenue target</li>\n<li>You have experience using Kustomer (or a similar CRM tool)</li>\n<li>You'll be joining a scaling company so we'd love for you to be willing to take on new projects and get involved in the teams growth</li>\n<li>You have an excellent telephone manner and objection handling skills</li>\n<li>You have excellent verbal, written and interpersonal communication skills in English</li>\n<li>You are confident, outgoing and enthusiastic</li>\n<li>You are incredibly self motivated and conscientious, wanting to make a real difference to the business</li>\n<li>You are willing to work with Product Owners across all areas of businesses in gaining feedback that can make the real changes to members experience of Tide</li>\n<li>You possess some knowledge of Buyer Behaviour, Sales and KYC</li>\n<li>You're able to get your strengths from working and collaborating in a team dynamic but also to work independently to your KPIs and targets</li>\n</ul>\n<p><strong>What you’ll get in return:</strong></p>\n<p>Make work, work for you! We are embracing new ways of working and support flexible working arrangements. With our Working Out of Office (WOO) policy our colleagues can work remotely from home or anywhere in their assigned Indian state. Additionally, you can work from a different country or Indian state for 90 days of the year. Plus, you’ll get:</p>\n<ul>\n<li>Competitive salary</li>\n<li>Self &amp; Family Health Insurance</li>\n<li>Term &amp; Life Insurance</li>\n<li>OPD Benefits</li>\n<li>Mental wellbeing through Plumm</li>\n<li>Learning &amp; Development Budget</li>\n<li>WFH Setup allowance</li>\n<li>15 days of Privilege leaves</li>\n<li>12 days of Casual leaves</li>\n<li>12 days of Sick leaves</li>\n<li>3 paid days off for volunteering or L&amp;D activities</li>\n<li>Stock Options</li>\n</ul>\n<p><strong>Tidean Ways of Working </strong></p>\n<p>At Tide, we champion a <strong>flexible workplace </strong>model that<strong> </strong>supports both in-person and remote work to cater to the specific needs of our different teams. </p>\n<p>While remote work is supported, we believe in the power of face-to-face interactions to foster team spirit and collaboration. Our offices are designed as hubs for innovation and team-building, where we encourage regular in-person gatherings to foster a strong sense of community.</p>\n<p><strong>Tide is a place for everyone</strong></p>\n<p>At Tide, we believe that we can only succeed if we let our differences enrich our culture. Our Tideans come from a variety of backgrounds and experience levels. We consider everyone irrespective of their ethnicity, religion, sexual orientation, gender identity, family or parental status, national origin, veteran, neurodiversity or differently-abled status. We celebrate diversity in our workforce as a cornerstone of our success. Our commitment to a broad spectrum of ideas and backgrounds is what enables us to build products that resonate with our members’ diverse needs and lives. </p>\n<p>We are One Team and foster a transparent and inclusive environment, where everyone’s voice is heard.</p>\n<p> </p>",
        "applicationUrl": "https://boards.greenhouse.io/tide/jobs/5988120003",
        "language": "en",
        "clearanceRequired": true,
        "salaryCurrency": "10 LPA",
        "jobVacancies": 15,
        "companyWebsiteUrl": "https://www.tide.co/",
        "companyLinkedinUrl": "https://www.linkedin.com/company/tide-banking",
        "companyRating": 4.4,
        "companyLocation": "India, Delhi NCR",
        "companySize": 163,
        "industry": "Chemical",
        "companyDescription": "The chemical industry produces chemicals and related products used in a wide range of industries, including manufacturing, agriculture, and pharmaceuticals."
    },
    {
        "companyName": "Zeta",
        "iconUrl": "https://jobdataapi.com/media/company/logo/22/04/zetasuite.jpg",
        "jobTitle": "Product Manager I/II",
        "location": "Mumbai / Bangalore",
        "jobType": "Full Time",
        "hasRemote": false,
        "easyApply": true,
        "published": "2024-07-03T11:32:07Z",
        "description": "<b>All about Zeta Suite : </b><br/><span>Zeta is a </span><b>Next-Gen Banking Tech</b><span> company that empowers banks and fintechs to launch banking products for the future. It was founded by </span><a href=\"https://en.wikipedia.org/wiki/Bhavin_Turakhia\">Bhavin Turakhia</a><span> and Ramki Gaddipati in 2015.Our flagship processing platform - Zeta Tachyon - is the industry’s first modern, cloud-native, and fully API-enabled stack that brings together issuance, processing, lending, core banking, fraud &amp; risk, and many more capabilities as a single-vendor stack. 15M+ cards have been issued on our platform globally.</span><br/><span>Zeta Tachyon offers:-</span><span>-Rich digital-first cardholder experiences.</span><span>-Native embeddable banking support.</span><span>-Hyper-Personalisation Policy Engine to launch segment-of-one card programs.</span><span>-Web-based product configurators to launch in days vs. quarters.</span><span>-Rapid innovation &amp; extensibility via APIs, event streams, and more.</span><span>-Modern &amp; intuitive web-based back office experiences.</span><span>-Next-gen regulatory risk &amp; compliance capabilities.</span><br/><span>Zeta is actively working with the largest Banks and Fintechs in multiple global markets transforming customer experience for multi-million card portfolios.</span><br/><span>Zeta has over </span><b>1700+</b><span> employees - with over </span><b>70%</b><span> roles in R&amp;D - across locations in the </span><b>US</b><span>, </span><b>EMEA</b><span>, and </span><b>Asia</b><span>. We raised </span><b>$280 million</b><span> at a </span><b>$1.5 billion</b><span> valuation from Softbank, Mastercard, and other investors in 2021.</span><span>Learn more @ </span><a href=\"http://www.zeta.tech/\">www.zeta.tech</a><span>, </span><a href=\"https://careers.zeta.tech/\">careers.zeta.tech</a><span>, </span><a href=\"https://in.linkedin.com/company/zetasuite\">Linkedin</a><span>, </span><a href=\"https://twitter.com/zetasuite\">Twitter</a><br/><span>Zeta is looking for a </span><b>Product Manager II</b><span>  for its Tachyon suite of products who can think from first principles and reimagine the world of payments and banking.</span><br/><b>The Role : </b><br/><span>You'll be working closely with the leadership and the Tachyon product team to build and scale the card issuance and core payments processing platforms that process payments from major card networks across the globe as well as payment systems like UPI.</span><span>Opportunity to build an in-depth understanding about various payment systems</span><b> </b><span>and you get to build innovative features leveraging the most modern payment trends </span>\n<h3>Responsibilities</h3>\n<ul>\n<li><b>Planning </b></li><li>Define the goals, scope and use cases for the core capability to be built </li><li>Enhance Tachyon Interfaces such as API’s, Events, Webhooks for various consumers </li><li>Define the UX experiences and capabilities to be built for various banking personas such as Customer Services, Business Operations etc  </li><li><b>Prioritization &amp; Execution </b></li><li>Own the roadmap for one or more part of the product</li><li>Apply the lens of strategy, goals and Tachyon’s purpose to prioritize problems to solve. </li><li>Slice the capabilities into smaller rapidly shippable features</li><li>Work very closely with Engineering, Operations, Design,  Customer Success, Client and Partner teams to get things done. </li><li><b>Communication</b></li><li>Evangelize and communicate the product plan.</li><li>Influence Engineering Teams and other stakeholders</li></ul>\n<h3>Skills:</h3>\n<ul>\n<li>Strong Understanding of System Design </li><li>Excellent communication (written and verbal) and interpersonal skills</li><li>Adapting to complex situations with the aim to achieve business goals</li><li>You conceive possibilities, think big picture, but deliver on the details</li><br/></ul>\n<h3>Experience &amp; Qualifications:</h3>\n<ul>\n<li>At least 5+ years of experience in a Technology Product Management role</li><li>Track record of building &amp; shipping high-quality Enterprise or SaaS products with high levels of ownership</li><li>Prior Experience in Payment Systems is highly desirable </li><li>An engineering / technical background that will allow you to reason about product trade-offs and make good choices with minimal inputs from engineers</li></ul><b>Life At Zeta</b><br/><span>At Zeta, we want you to grow to be the best version of yourself by unlocking the great potential that lies within you. This is why our core philosophy is </span><b>‘People Must Grow.’</b><span> We recognize your aspirations; act as enablers by bringing you the right opportunities, and let you grow as you chase disruptive goals. </span><br/><br/><b>#LifeAtZeta is adventurous and exhilarating at the same time. </b><span>You get to work with some of the best minds in the industry and experience a culture that values the diversity of thoughts. If you want to push boundaries, learn continuously and grow to be the best version of yourself,  </span><b>Zeta is the place to be!  </b><a href=\"https://careers.zeta.tech/\">Explore the life at zeta </a><br/><b>Zeta is an equal opportunity employer.  </b><br/><span>At Zeta, we are committed to equal employment opportunities regardless of job history, disability, gender identity, religion, race, marital/parental status, or another special status. We are proud to be an equitable workplace that welcomes individuals from all walks of life if they fit the roles and responsibilities.</span>",
        "applicationUrl": "https://jobs.lever.co/zeta/dbf59802-6f24-40b7-83f9-b2cae09c1d18",
        "language": "en",
        "clearanceRequired": true,
        "salaryCurrency": "10 LPA",
        "jobVacancies": 10,
        "companyWebsiteUrl": "https://www.zeta.tech/",
        "companyLinkedinUrl": "https://www.linkedin.com/company/zetasuite/",
        "companyRating": 2.8,
        "companyLocation": "Mumbai / Bangalore",
        "companySize": 130,
        "industry": "Healthcare IT",
        "companyDescription": "The healthcare IT industry focuses on the development and implementation of information technology solutions to improve healthcare delivery and patient outcomes."
    },
    {
        "companyName": "Segula Technologies",
        "iconUrl": "https://jobdataapi.com/media/company/logo/23/07/segula_group.jpg",
        "jobTitle": "Data Analytics",
        "location": "Pune, India",
        "jobType": "Full Time",
        "hasRemote": false,
        "easyApply": false,
        "published": "2024-07-03T11:30:23Z",
        "description": "<h3>Company Description</h3><p>At SEGULA Technologies you will have the opportunity to work on exciting projects and help shaping the future within an engineering company which is at the heart of innovation. From 3D printing, augmented reality, connected vehicle to the factory of the future – new technologies are part of our 10,000 ingenious collaborators’ day-to-day life. Would you like to join in?</p><p>SEGULA Technologies is always looking for new, ingenious, and daring talents worldwide to support all the major industrial actors within the automotive, aeronautics, energy, railway, naval, oil &amp; gas and pharmaceutical sectors.</p><p>For more information: <a href=\"https://www.segulatechnologies.com\">https://www.segulatechnologies.com</a></p><h3>Job Description</h3><ul><li><ul><li><ul><li><ul><li>Ready to work in US shift timing.</li><li>Experience range 1-3 years</li><li>NP : Immediate</li><li>Work within engineering and cross functional organization to create dashboards for customer usage</li><li>Develop pipeline of connect vehicle data to dashboards</li><li>Familiar with Analytics platforms such as DataBrick, Palantir Foundry and Snowflake</li><li>Expert level in Phython programming for Pipeline development/data transformation</li><li>Knowledge of PySpark/JavaScrip programming a plus</li><li>Proficient w/PowerBI for dashboarding</li></ul></li></ul></li></ul></li></ul>",
        "applicationUrl": "https://jobs.smartrecruiters.com/SegulaTechnologies/743999998145601-data-analytics",
        "language": "en",
        "clearanceRequired": true,
        "salaryCurrency": "10 LPA",
        "jobVacancies": 14,
        "companyWebsiteUrl": "https://www.segulatechnologies.com",
        "companyLinkedinUrl": "https://www.linkedin.com/company/segula-technologies",
        "companyRating": 3,
        "companyLocation": "Pune, India",
        "companySize": 142,
        "industry": "Software Development",
        "companyDescription": "The software development industry focuses on designing, creating, and maintaining software applications and systems for various purposes, including business, entertainment, and personal use."

    },
    {
        "companyName": "ServiceNow",
        "iconUrl": "https://jobdataapi.com/media/company/logo/22/10/qSd2WB84_400x400.jpg",
        "jobTitle": "Mgr, Software Engrg Mgmt",
        "location": "Hyderabad, India",
        "jobType": "Full Time",
        "hasRemote": true,
        "easyApply": false,
        "published": "2024-07-03T11:26:39Z",
        "description": "<h3>Company Description</h3><p><span>At ServiceNow, our technology makes the world work for everyone, and our people make it possible. We move fast because the world can’t wait, and we innovate in ways no one else can for our customers and communities. By joining ServiceNow, you are part of an ambitious team of change makers who have a restless curiosity and a drive for ingenuity. We know that your best work happens when you live your best life and share your unique talents, so we do everything we can to make that possible. We dream big together, supporting each other to make our individual and collective dreams come true. The future is ours, and it starts with you. </span></p> <p><span>With more than 7,700+ customers, we serve approximately 85% of the Fortune 500®, and we're proud to be one of FORTUNE 100 Best Companies to Work For® and World's Most Admired Companies™.</span></p> <p><span>Learn more on <a href=\"https://blogs.servicenow.com/category/life-at-now.html\">Life at Now blog</a> and <a href=\"https://www.youtube.com/playlist?list=PLtPPHGXv_JpmhypERyQKm5zO2Wd65QinB\">hear from our employees</a> about their experiences working at ServiceNow.</span></p> <p><span>Unsure if you meet all the qualifications of a job description but are deeply excited about the role? We still encourage you to apply! At ServiceNow, we are committed to creating an inclusive environment where all voices are heard, valued, and respected. We welcome all candidates, including individuals from non-traditional, varied backgrounds, that might not come from a typical path connected to this role. We believe skills and experience are transferrable, and the desire to dream big makes for great candidates.</span></p><h3>Job Description</h3><p><strong>What you get to do in this role:</strong><strong>  </strong> </p> <ul> <li>Manage product development activities</li> <li>Work with product management, design, support and other dev teams to create high-quality solutions</li> <li>Manage daily activities of the development team</li> <li>Solve difficult and sometimes ambiguous problems</li> <li>Manage departmental resources, staffing, mentoring, and enhancing and maintaining a best-of-class engineering team<br/></li> </ul><h3>Qualifications</h3><p><strong>To be successful in this role you have:</strong></p> <ul> <li>6+ years of experience with technologies relevant to SN and advanced coding skills</li> <li>Experience with open source tools and agile development environments</li> <li>Fluency in one or more relevant programming language (Java, C++, Ruby. Shell, JavaScript)</li> <li>An understanding of broad concepts and experience using those concepts to understand and develop solutions for problems</li> <li>Ability to execute a project based on our priorities, context, risks and desired outcomes<br/></li> </ul> <p>FD21</p><h3>Additional Information</h3><p><span>ServiceNow is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, creed, religion, sex, sexual orientation, national origin or nationality, ancestry, age, disability, gender identity or expression, marital status, veteran status or any other category protected by law.</span></p> <p><span>At ServiceNow, we lead with flexibility and trust in our distributed world of work. <a href=\"https://www.servicenow.com/content/dam/servicenow-assets/public/en-us/doc-type/other-document/careers/new-world-of-work-personas.pdf\">Click here</a> to learn about our work personas: flexible, remote and required-in-office.</span></p> <p><span>If you require a reasonable accommodation to complete any part of the application process, or are limited in the ability or unable to access or use this online application process and need an alternative method for applying, you may contact us at <a href=\"mailto:talent.acquisition@servicenow.com\">talent.acquisition@servicenow.com</a> for assistance.</span></p> <p><span>For positions requiring access to technical data subject to export control regulations, including Export Administration Regulations (EAR), ServiceNow may have to obtain export licensing approval from the U.S. Government for certain individuals. All employment is contingent upon ServiceNow obtaining any export license or other approval that may be required by the U.S. Government.</span></p> <p><span>Please Note: Fraudulent job postings/job scams are increasingly common. <a href=\"https://www.servicenow.com/fraudulent-job-scams.html\">Click here</a> to learn what to watch out for and how to protect yourself. All genuine ServiceNow job postings can be found through the <a href=\"https://www.servicenow.com/careers.html\">ServiceNow Careers site</a>.</span></p> <p> </p> <p><span>From Fortune. © 2022 Fortune Media IP Limited All rights reserved. Used under license.</span></p> <p><span>Fortune and Fortune Media IP Limited are not affiliated with, and do not endorse products or services of, ServiceNow.</span></p>",
        "applicationUrl": "https://jobs.smartrecruiters.com/ServiceNow/743999998145315-mgr-software-engrg-mgmt",
        "language": "en",
        "clearanceRequired": false,
        "salaryCurrency": "10 LPA",
        "jobVacancies": 8,
        "companyWebsiteUrl": "https://www.servicenow.com",
        "companyLinkedinUrl": "https://www.linkedin.com/company/servicenow",
        "companyRating": 2.3,
        "companyLocation": "Hyderabad, India",
        "companySize": 48,
        "industry": "Insurance",
        "companyDescription": "The insurance industry provides risk management through the transfer and pooling of risks, offering protection against financial loss for individuals and businesses."
    },
    {
        "companyName": "Dun & Bradstreet",
        "iconUrl": "https://jobdataapi.com/media/company/logo/22/02/DunBradstreet.jpg",
        "jobTitle": "Software Engineer II (R-16435)",
        "location": "Hyderabad - India",
        "jobType": "Full Time",
        "hasRemote": false,
        "easyApply": true,
        "published": "2024-07-03T11:14:00Z",
        "description": "<b>Why We Work at Dun &amp; Bradstreet</b>Dun &amp; Bradstreet unlocks the power of data through analytics, creating a better tomorrow. Each day, we are finding new ways to strengthen our award-winning culture and accelerate creativity, innovation and growth. Our 6,500+ global team members are passionate about what we do. We are dedicated to helping clients turn uncertainty into confidence, risk into opportunity and potential into prosperity. Bold and diverse thinkers are always welcome. Come join us! Learn more at <a href=\"https://bit.ly/dnb-careers\">dnb.com/careers</a>.<br/><b>Team Overview:</b> Our D&amp;B Hoovers team helps customers prospect and research through modern UI experiences and powerful backend systems. We build complex search solutions on top of scalable architectures that allow us to support hundreds of thousands of users and large data sets. We're working hard to build the most advanced set of business data and analytics on the market. We move fast and take great pride in what we're building. If you love solving hard data problems, working with great teams, functional programming, and building scalable software using modern technologies like React, Scala, Elasticsearch, Postgres and Akka, we want to talk with you<br/><b>The Role:</b> As a Software Engineer I in the D&amp;B Hoovers Engineering team you will join a team of brilliant, friendly and energetic engineers, solutions architects, developers, QA engineers and project managers who strive to deliver best of breed custom solutions to our customers. Are you someone that can thrive in a high energy, high growth, fast paced environment? Then you might be just who we are looking for.\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Write simple code (low maintenance, extensibility, testability and performance</li><li>Work with leads on development and implementation of technical solutions aligned to strategic initiatives Determine operational feasibility of proposed solutions</li><li>Serve as an escalation point for internal customer support and product teams</li><li>Contribute to development efforts to create, maintain, and fix customer facing product functionality</li><li>Reproduce, troubleshoot and determine the root cause of production issues</li><li>Participate in daily standup team meetings/bi-weekly sprint planning &amp; sprint-end demo/retrospective and work cross-functionality with other teams in Lattice to drive the innovations of our products. Collaborate with developers and operations teams to build and deploy custom solutions in GCP</li><li>Collaborate with the team to take advantage of new concepts/technologies</li><li>Make informed decisions quickly and taking ownership of services at scale</li><li>Solid understanding of Agile methodology and the ability to recognize opportunities for enhancement and continuous improvement</li><li>Coordinate and manage work with globally distributed teams</li><li>Ensuring high quality of team deliverables through rigorous in-development testing methods</li><li>Prepare and validate estimates for delivery of team backlog</li><li>Develop a thorough understanding of the business domain and the wider tech platform you are contributing to.</li></ul>\n<h3>Qualifications:</h3>\n<ul>\n<li>Experience in React, JavaScript, Typescript, HTML, and CSS</li><li>Advanced understanding of React.</li><li>3- 5 years of professional software development experience.</li><li>Experience working within agile development team</li><li>Understanding of RESTful communication</li><li>Must demonstrate excellent troubleshooting and problem assessment/solving skills</li><li>Well organized, disciplined and able to manage time and priorities effectively</li><li>Strong oral and written communication skills and able to articulate complex scenarios in unambiguous terms</li><li>Strong problem solving and root cause analysis skills</li><li>Bachelor's or master’s degree in Computer Science, Computer Engineering or similar</li></ul>All Dun &amp; Bradstreet job postings can be found at <a href=\"https://www.dnb.com/about-us/careers-and-people/joblistings.html\">https://www.dnb.com/about-us/careers-and-people/joblistings.html</a> and <a href=\"https://jobs.lever.co/dnb\">https://jobs.lever.co/dnb</a>. Official communication from Dun &amp; Bradstreet will come from an email address ending in @dnb.com.<br/><u>Notice to Applicants</u>: Please be advised that this job posting page is hosted and powered by Lever. Your use of this page is subject to Lever's <a href=\"https://www.lever.co/privacy-notice/\">Privacy Notice</a> and <a href=\"https://www.lever.co/cookie-policy/\">Cookie Policy</a>, which governs the processing of visitor data on this platform.",
        "applicationUrl": "https://jobs.lever.co/dnb/2222f1bb-454d-4c68-9fd0-0afbe6a46635",
        "language": "en",
        "clearanceRequired": false,
        "salaryCurrency": "10 LPA",
        "jobVacancies": 6,
        "companyWebsiteUrl": "https://www.dnb.com/",
        "companyLinkedinUrl": "https://www.linkedin.com/company/dun-&-bradstreet",
        "companyRating": 2.2,
        "companyLocation": "Hyderabad - India",
        "companySize": 70,
        "industry": "Media",
        "companyDescription": "The media industry produces and distributes news, information, and entertainment content through various platforms, including print, television, radio, and digital media."
    }
]